kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
#define CAN_ERRSTS_LERRC_Pos                                        (4U)
#define CAN_ERRSTS_LERRC_Msk                                        (0x7UL << CAN_ERRSTS_LERRC_Pos)                                /*!< 0x00000070 */
#define CAN_ERRSTS_LERRC                                            CAN_ERRSTS_LERRC_Msk                                           /*!<LEC[2:0] bits (Last Error Code) */
#define CAN_ERRSTS_LERRC_0                                          (0x1UL << CAN_ERRSTS_LERRC_Pos)                                /*!< 0x00000010 */
#define CAN_ERRSTS_LERRC_1                                          (0x2UL << CAN_ERRSTS_LERRC_Pos)                                /*!< 0x00000020 */
#define CAN_ERRSTS_LERRC_2                                          (0x4UL << CAN_ERRSTS_LERRC_Pos)                                /*!< 0x00000040 */

#define CAN_ERRSTS_TXERRCNT_Pos                                     (16U)
#define CAN_ERRSTS_TXERRCNT_Msk                                     (0xFFUL << CAN_ERRSTS_TXERRCNT_Pos)                            /*!< 0x00FF0000 */
#define CAN_ERRSTS_TXERRCNT                                         CAN_ERRSTS_TXERRCNT_Msk                                        /*!<Least significant byte of the 9-bit Transmit Error Counter */
#define CAN_ERRSTS_RXERRCNT_Pos                                     (24U)
#define CAN_ERRSTS_RXERRCNT_Msk                                     (0xFFUL << CAN_ERRSTS_RXERRCNT_Pos)                            /*!< 0xFF000000 */
#define CAN_ERRSTS_RXERRCNT                                         CAN_ERRSTS_RXERRCNT_Msk                                        /*!<Receive Error Counter */

/*******************  Bit definition for CAN_BITTIM register  ********************/
#define CAN_BITTIM_BRPSC_Pos                                        (0U)
#define CAN_BITTIM_BRPSC_Msk                                        (0x3FFUL << CAN_BITTIM_BRPSC_Pos)                              /*!< 0x000003FF */
#define CAN_BITTIM_BRPSC                                            CAN_BITTIM_BRPSC_Msk                                           /*!<Baud Rate Prescaler */
#define CAN_BITTIM_TIMSEG1_Pos                                      (16U)
#define CAN_BITTIM_TIMSEG1_Msk                                      (0xFUL << CAN_BITTIM_TIMSEG1_Pos)                              /*!< 0x000F0000 */
#define CAN_BITTIM_TIMSEG1                                          CAN_BITTIM_TIMSEG1_Msk                                         /*!<Time Segment 1 */
#define CAN_BITTIM_TIMSEG1_0                                        (0x1UL << CAN_BITTIM_TIMSEG1_Pos)                              /*!< 0x00010000 */
#define CAN_BITTIM_TIMSEG1_1                                        (0x2UL << CAN_BITTIM_TIMSEG1_Pos)                              /*!< 0x00020000 */
#define CAN_BITTIM_TIMSEG1_2                                        (0x4UL << CAN_BITTIM_TIMSEG1_Pos)                              /*!< 0x00040000 */
#define CAN_BITTIM_TIMSEG1_3                                        (0x8UL << CAN_BITTIM_TIMSEG1_Pos)                              /*!< 0x00080000 */
#define CAN_BITTIM_TIMSEG2_Pos                                      (20U)
#define CAN_BITTIM_TIMSEG2_Msk                                      (0x7UL << CAN_BITTIM_TIMSEG2_Pos)                              /*!< 0x00700000 */
#define CAN_BITTIM_TIMSEG2                                          CAN_BITTIM_TIMSEG2_Msk                                         /*!<Time Segment 2 */
#define CAN_BITTIM_TIMSEG2_0                                        (0x1UL << CAN_BITTIM_TIMSEG2_Pos)                              /*!< 0x00100000 */
#define CAN_BITTIM_TIMSEG2_1                                        (0x2UL << CAN_BITTIM_TIMSEG2_Pos)                              /*!< 0x00200000 */
#define CAN_BITTIM_TIMSEG2_2                                        (0x4UL << CAN_BITTIM_TIMSEG2_Pos)                              /*!< 0x00400000 */
#define CAN_BITTIM_RSYNJW_Pos                                       (24U)
#define CAN_BITTIM_RSYNJW_Msk                                       (0x3UL << CAN_BITTIM_RSYNJW_Pos)                               /*!< 0x03000000 */
#define CAN_BITTIM_RSYNJW                                           CAN_BITTIM_RSYNJW_Msk                                          /*!<Resynchronization Jump Width */
#define CAN_BITTIM_RSYNJW_0                                         (0x1UL << CAN_BITTIM_RSYNJW_Pos)                               /*!< 0x01000000 */
#define CAN_BITTIM_RSYNJW_1                                         (0x2UL << CAN_BITTIM_RSYNJW_Pos)                               /*!< 0x02000000 */
#define CAN_BITTIM_LBKMEN_Pos                                       (30U)
#define CAN_BITTIM_LBKMEN_Msk                                       (0x1UL << CAN_BITTIM_LBKMEN_Pos)                               /*!< 0x40000000 */
#define CAN_BITTIM_LBKMEN                                           CAN_BITTIM_LBKMEN_Msk                                          /*!<Loop Back Mode (Debug) */
#define CAN_BITTIM_SILMEN_Pos                                       (31U)
#define CAN_BITTIM_SILMEN_Msk                                       (0x1UL << CAN_BITTIM_SILMEN_Pos)                               /*!< 0x80000000 */
#define CAN_BITTIM_SILMEN                                           CAN_BITTIM_SILMEN_Msk                                          /*!<Silent Mode */


/*!<Mailbox registers */
/******************  Bit definition for CAN_TXMID0 register  ********************/
#define CAN_TXMID0_TXMREQ_Pos                                       (0U)
#define CAN_TXMID0_TXMREQ_Msk                                       (0x1UL << CAN_TXMID0_TXMREQ_Pos)                               /*!< 0x00000001 */
#define CAN_TXMID0_TXMREQ                                           CAN_TXMID0_TXMREQ_Msk                                          /*!<Transmit Mailbox Request */
#define CAN_TXMID0_TXRFREQ_Pos                                      (1U)
#define CAN_TXMID0_TXRFREQ_Msk                                      (0x1UL << CAN_TXMID0_TXRFREQ_Pos)                              /*!< 0x00000002 */
#define CAN_TXMID0_TXRFREQ                                          CAN_TXMID0_TXRFREQ_Msk                                         /*!<Remote Transmission Request */
#define CAN_TXMID0_IDTYPESEL_Pos                                    (2U)
#define CAN_TXMID0_IDTYPESEL_Msk                                    (0x1UL << CAN_TXMID0_IDTYPESEL_Pos)                            /*!< 0x00000004 */
#define CAN_TXMID0_IDTYPESEL                                        CAN_TXMID0_IDTYPESEL_Msk                                       /*!<Identifier Extension */
#define CAN_TXMID0_EXTID_Pos                                        (3U)
#define CAN_TXMID0_EXTID_Msk                                        (0x3FFFFUL << CAN_TXMID0_EXTID_Pos)                            /*!< 0x001FFFF8 */
#define CAN_TXMID0_EXTID                                            CAN_TXMID0_EXTID_Msk                                           /*!<Extended Identifier */
#define CAN_TXMID0_STDID_Pos                                        (21U)
#define CAN_TXMID0_STDID_Msk                                        (0x7FFUL << CAN_TXMID0_STDID_Pos)                              /*!< 0xFFE00000 */
#define CAN_TXMID0_STDID                                            CAN_TXMID0_STDID_Msk                                           /*!<Standard Identifier or Extended Identifier */

