kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
/*******************  Bit definition for CAN_TXDLEN1 register  ******************/
#define CAN_TXDLEN1_DLCODE_Pos                                      (0U)
#define CAN_TXDLEN1_DLCODE_Msk                                      (0xFUL << CAN_TXDLEN1_DLCODE_Pos)                              /*!< 0x0000000F */
#define CAN_TXDLEN1_DLCODE                                          CAN_TXDLEN1_DLCODE_Msk                                         /*!<Data Length Code */
#define CAN_TXDLEN1_TXTS_Pos                                        (8U)
#define CAN_TXDLEN1_TXTS_Msk                                        (0x1UL << CAN_TXDLEN1_TXTS_Pos)                                /*!< 0x00000100 */
#define CAN_TXDLEN1_TXTS                                            CAN_TXDLEN1_TXTS_Msk                                           /*!<Transmit Global Time */
#define CAN_TXDLEN1_MTS_Pos                                         (16U)
#define CAN_TXDLEN1_MTS_Msk                                         (0xFFFFUL << CAN_TXDLEN1_MTS_Pos)                              /*!< 0xFFFF0000 */
#define CAN_TXDLEN1_MTS                                             CAN_TXDLEN1_MTS_Msk                                            /*!<Message Time Stamp */

/*******************  Bit definition for CAN_TXMDL1 register  ******************/
#define CAN_TXMDL1_DATABYTE0_Pos                                    (0U)
#define CAN_TXMDL1_DATABYTE0_Msk                                    (0xFFUL << CAN_TXMDL1_DATABYTE0_Pos)                           /*!< 0x000000FF */
#define CAN_TXMDL1_DATABYTE0                                        CAN_TXMDL1_DATABYTE0_Msk                                       /*!<Data byte 0 */
#define CAN_TXMDL1_DATABYTE1_Pos                                    (8U)
#define CAN_TXMDL1_DATABYTE1_Msk                                    (0xFFUL << CAN_TXMDL1_DATABYTE1_Pos)                           /*!< 0x0000FF00 */
#define CAN_TXMDL1_DATABYTE1                                        CAN_TXMDL1_DATABYTE1_Msk                                       /*!<Data byte 1 */
#define CAN_TXMDL1_DATABYTE2_Pos                                    (16U)
#define CAN_TXMDL1_DATABYTE2_Msk                                    (0xFFUL << CAN_TXMDL1_DATABYTE2_Pos)                           /*!< 0x00FF0000 */
#define CAN_TXMDL1_DATABYTE2                                        CAN_TXMDL1_DATABYTE2_Msk                                       /*!<Data byte 2 */
#define CAN_TXMDL1_DATABYTE3_Pos                                    (24U)
#define CAN_TXMDL1_DATABYTE3_Msk                                    (0xFFUL << CAN_TXMDL1_DATABYTE3_Pos)                           /*!< 0xFF000000 */
#define CAN_TXMDL1_DATABYTE3                                        CAN_TXMDL1_DATABYTE3_Msk                                       /*!<Data byte 3 */

/*******************  Bit definition for CAN_TXMDH1 register  ******************/
#define CAN_TXMDH1_DATABYTE4_Pos                                    (0U)
#define CAN_TXMDH1_DATABYTE4_Msk                                    (0xFFUL << CAN_TXMDH1_DATABYTE4_Pos)                           /*!< 0x000000FF */
#define CAN_TXMDH1_DATABYTE4                                        CAN_TXMDH1_DATABYTE4_Msk                                       /*!<Data byte 4 */
#define CAN_TXMDH1_DATABYTE5_Pos                                    (8U)
#define CAN_TXMDH1_DATABYTE5_Msk                                    (0xFFUL << CAN_TXMDH1_DATABYTE5_Pos)                           /*!< 0x0000FF00 */
#define CAN_TXMDH1_DATABYTE5                                        CAN_TXMDH1_DATABYTE5_Msk                                       /*!<Data byte 5 */
#define CAN_TXMDH1_DATABYTE6_Pos                                    (16U)
#define CAN_TXMDH1_DATABYTE6_Msk                                    (0xFFUL << CAN_TXMDH1_DATABYTE6_Pos)                           /*!< 0x00FF0000 */
#define CAN_TXMDH1_DATABYTE6                                        CAN_TXMDH1_DATABYTE6_Msk                                       /*!<Data byte 6 */
#define CAN_TXMDH1_DATABYTE7_Pos                                    (24U)
#define CAN_TXMDH1_DATABYTE7_Msk                                    (0xFFUL << CAN_TXMDH1_DATABYTE7_Pos)                           /*!< 0xFF000000 */
#define CAN_TXMDH1_DATABYTE7                                        CAN_TXMDH1_DATABYTE7_Msk                                       /*!<Data byte 7 */

/*******************  Bit definition for CAN_TXMID2 register  *******************/
#define CAN_TXMID2_TXMREQ_Pos                                       (0U)
#define CAN_TXMID2_TXMREQ_Msk                                       (0x1UL << CAN_TXMID2_TXMREQ_Pos)                               /*!< 0x00000001 */
#define CAN_TXMID2_TXMREQ                                           CAN_TXMID2_TXMREQ_Msk                                          /*!<Transmit Mailbox Request */
#define CAN_TXMID2_TXRFREQ_Pos                                      (1U)
#define CAN_TXMID2_TXRFREQ_Msk                                      (0x1UL << CAN_TXMID2_TXRFREQ_Pos)                              /*!< 0x00000002 */
#define CAN_TXMID2_TXRFREQ                                          CAN_TXMID2_TXRFREQ_Msk                                         /*!<Remote Transmission Request */
#define CAN_TXMID2_IDTYPESEL_Pos                                    (2U)
#define CAN_TXMID2_IDTYPESEL_Msk                                    (0x1UL << CAN_TXMID2_IDTYPESEL_Pos)                            /*!< 0x00000004 */
#define CAN_TXMID2_IDTYPESEL                                        CAN_TXMID2_IDTYPESEL_Msk                                       /*!<Identifier Extension */
#define CAN_TXMID2_EXTID_Pos                                        (3U)
#define CAN_TXMID2_EXTID_Msk                                        (0x3FFFFUL << CAN_TXMID2_EXTID_Pos)                            /*!< 0x001FFFF8 */
#define CAN_TXMID2_EXTID                                            CAN_TXMID2_EXTID_Msk                                           /*!<Extended identifier */
#define CAN_TXMID2_STDID_Pos                                        (21U)
#define CAN_TXMID2_STDID_Msk                                        (0x7FFUL << CAN_TXMID2_STDID_Pos)                              /*!< 0xFFE00000 */
#define CAN_TXMID2_STDID                                            CAN_TXMID2_STDID_Msk                                           /*!<Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TXDLEN2 register  ******************/
#define CAN_TXDLEN2_DLCODE_Pos                                      (0U)
#define CAN_TXDLEN2_DLCODE_Msk                                      (0xFUL << CAN_TXDLEN2_DLCODE_Pos)                              /*!< 0x0000000F */
#define CAN_TXDLEN2_DLCODE                                          CAN_TXDLEN2_DLCODE_Msk                                         /*!<Data Length Code */
#define CAN_TXDLEN2_TXTS_Pos                                        (8U)
#define CAN_TXDLEN2_TXTS_Msk                                        (0x1UL << CAN_TXDLEN2_TXTS_Pos)                                /*!< 0x00000100 */
#define CAN_TXDLEN2_TXTS                                            CAN_TXDLEN2_TXTS_Msk                                           /*!<Transmit Global Time */
#define CAN_TXDLEN2_MTS_Pos                                         (16U)
#define CAN_TXDLEN2_MTS_Msk                                         (0xFFFFUL << CAN_TXDLEN2_MTS_Pos)                              /*!< 0xFFFF0000 */
#define CAN_TXDLEN2_MTS                                             CAN_TXDLEN2_MTS_Msk                                            /*!<Message Time Stamp */

/*******************  Bit definition for CAN_TXMDL2 register  ******************/
#define CAN_TXMDL2_DATABYTE0_Pos                                    (0U)
#define CAN_TXMDL2_DATABYTE0_Msk                                    (0xFFUL << CAN_TXMDL2_DATABYTE0_Pos)                           /*!< 0x000000FF */
#define CAN_TXMDL2_DATABYTE0                                        CAN_TXMDL2_DATABYTE0_Msk                                       /*!<Data byte 0 */
#define CAN_TXMDL2_DATABYTE1_Pos                                    (8U)
#define CAN_TXMDL2_DATABYTE1_Msk                                    (0xFFUL << CAN_TXMDL2_DATABYTE1_Pos)                           /*!< 0x0000FF00 */
#define CAN_TXMDL2_DATABYTE1                                        CAN_TXMDL2_DATABYTE1_Msk                                       /*!<Data byte 1 */
#define CAN_TXMDL2_DATABYTE2_Pos                                    (16U)
#define CAN_TXMDL2_DATABYTE2_Msk                                    (0xFFUL << CAN_TXMDL2_DATABYTE2_Pos)                           /*!< 0x00FF0000 */
#define CAN_TXMDL2_DATABYTE2                                        CAN_TXMDL2_DATABYTE2_Msk                                       /*!<Data byte 2 */
#define CAN_TXMDL2_DATABYTE3_Pos                                    (24U)
#define CAN_TXMDL2_DATABYTE3_Msk                                    (0xFFUL << CAN_TXMDL2_DATABYTE3_Pos)                           /*!< 0xFF000000 */
#define CAN_TXMDL2_DATABYTE3                                        CAN_TXMDL2_DATABYTE3_Msk                                       /*!<Data byte 3 */

