kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
/*******************  Bit definition for EINT_IPEND register  ********************/
#define EINT_IPEND_IPEND0_Pos                                       (0U)
#define EINT_IPEND_IPEND0_Msk                                       (0x1UL << EINT_IPEND_IPEND0_Pos)                               /*!< 0x00000001 */
#define EINT_IPEND_IPEND0                                           EINT_IPEND_IPEND0_Msk                                          /*!< Pending bit for line 0 */
#define EINT_IPEND_IPEND1_Pos                                       (1U)
#define EINT_IPEND_IPEND1_Msk                                       (0x1UL << EINT_IPEND_IPEND1_Pos)                               /*!< 0x00000002 */
#define EINT_IPEND_IPEND1                                           EINT_IPEND_IPEND1_Msk                                          /*!< Pending bit for line 1 */
#define EINT_IPEND_IPEND2_Pos                                       (2U)
#define EINT_IPEND_IPEND2_Msk                                       (0x1UL << EINT_IPEND_IPEND2_Pos)                               /*!< 0x00000004 */
#define EINT_IPEND_IPEND2                                           EINT_IPEND_IPEND2_Msk                                          /*!< Pending bit for line 2 */
#define EINT_IPEND_IPEND3_Pos                                       (3U)
#define EINT_IPEND_IPEND3_Msk                                       (0x1UL << EINT_IPEND_IPEND3_Pos)                               /*!< 0x00000008 */
#define EINT_IPEND_IPEND3                                           EINT_IPEND_IPEND3_Msk                                          /*!< Pending bit for line 3 */
#define EINT_IPEND_IPEND4_Pos                                       (4U)
#define EINT_IPEND_IPEND4_Msk                                       (0x1UL << EINT_IPEND_IPEND4_Pos)                               /*!< 0x00000010 */
#define EINT_IPEND_IPEND4                                           EINT_IPEND_IPEND4_Msk                                          /*!< Pending bit for line 4 */
#define EINT_IPEND_IPEND5_Pos                                       (5U)
#define EINT_IPEND_IPEND5_Msk                                       (0x1UL << EINT_IPEND_IPEND5_Pos)                               /*!< 0x00000020 */
#define EINT_IPEND_IPEND5                                           EINT_IPEND_IPEND5_Msk                                          /*!< Pending bit for line 5 */
#define EINT_IPEND_IPEND6_Pos                                       (6U)
#define EINT_IPEND_IPEND6_Msk                                       (0x1UL << EINT_IPEND_IPEND6_Pos)                               /*!< 0x00000040 */
#define EINT_IPEND_IPEND6                                           EINT_IPEND_IPEND6_Msk                                          /*!< Pending bit for line 6 */
#define EINT_IPEND_IPEND7_Pos                                       (7U)
#define EINT_IPEND_IPEND7_Msk                                       (0x1UL << EINT_IPEND_IPEND7_Pos)                               /*!< 0x00000080 */
#define EINT_IPEND_IPEND7                                           EINT_IPEND_IPEND7_Msk                                          /*!< Pending bit for line 7 */
#define EINT_IPEND_IPEND8_Pos                                       (8U)
#define EINT_IPEND_IPEND8_Msk                                       (0x1UL << EINT_IPEND_IPEND8_Pos)                               /*!< 0x00000100 */
#define EINT_IPEND_IPEND8                                           EINT_IPEND_IPEND8_Msk                                          /*!< Pending bit for line 8 */
#define EINT_IPEND_IPEND9_Pos                                       (9U)
#define EINT_IPEND_IPEND9_Msk                                       (0x1UL << EINT_IPEND_IPEND9_Pos)                               /*!< 0x00000200 */
#define EINT_IPEND_IPEND9                                           EINT_IPEND_IPEND9_Msk                                          /*!< Pending bit for line 9 */
#define EINT_IPEND_IPEND10_Pos                                      (10U)
#define EINT_IPEND_IPEND10_Msk                                      (0x1UL << EINT_IPEND_IPEND10_Pos)                              /*!< 0x00000400 */
#define EINT_IPEND_IPEND10                                          EINT_IPEND_IPEND10_Msk                                         /*!< Pending bit for line 10 */
#define EINT_IPEND_IPEND11_Pos                                      (11U)
#define EINT_IPEND_IPEND11_Msk                                      (0x1UL << EINT_IPEND_IPEND11_Pos)                              /*!< 0x00000800 */
#define EINT_IPEND_IPEND11                                          EINT_IPEND_IPEND11_Msk                                         /*!< Pending bit for line 11 */
#define EINT_IPEND_IPEND12_Pos                                      (12U)
#define EINT_IPEND_IPEND12_Msk                                      (0x1UL << EINT_IPEND_IPEND12_Pos)                              /*!< 0x00001000 */
#define EINT_IPEND_IPEND12                                          EINT_IPEND_IPEND12_Msk                                         /*!< Pending bit for line 12 */
#define EINT_IPEND_IPEND13_Pos                                      (13U)
#define EINT_IPEND_IPEND13_Msk                                      (0x1UL << EINT_IPEND_IPEND13_Pos)                              /*!< 0x00002000 */
#define EINT_IPEND_IPEND13                                          EINT_IPEND_IPEND13_Msk                                         /*!< Pending bit for line 13 */
#define EINT_IPEND_IPEND14_Pos                                      (14U)
#define EINT_IPEND_IPEND14_Msk                                      (0x1UL << EINT_IPEND_IPEND14_Pos)                              /*!< 0x00004000 */
#define EINT_IPEND_IPEND14                                          EINT_IPEND_IPEND14_Msk                                         /*!< Pending bit for line 14 */
#define EINT_IPEND_IPEND15_Pos                                      (15U)
#define EINT_IPEND_IPEND15_Msk                                      (0x1UL << EINT_IPEND_IPEND15_Pos)                              /*!< 0x00008000 */
#define EINT_IPEND_IPEND15                                          EINT_IPEND_IPEND15_Msk                                         /*!< Pending bit for line 15 */
#define EINT_IPEND_IPEND16_Pos                                      (16U)
#define EINT_IPEND_IPEND16_Msk                                      (0x1UL << EINT_IPEND_IPEND16_Pos)                              /*!< 0x00010000 */
#define EINT_IPEND_IPEND16                                          EINT_IPEND_IPEND16_Msk                                         /*!< Pending bit for line 16 */
#define EINT_IPEND_IPEND17_Pos                                      (17U)
#define EINT_IPEND_IPEND17_Msk                                      (0x1UL << EINT_IPEND_IPEND17_Pos)                              /*!< 0x00020000 */
#define EINT_IPEND_IPEND17                                          EINT_IPEND_IPEND17_Msk                                         /*!< Pending bit for line 17 */
#define EINT_IPEND_IPEND18_Pos                                      (18U)
#define EINT_IPEND_IPEND18_Msk                                      (0x1UL << EINT_IPEND_IPEND18_Pos)                              /*!< 0x00040000 */
#define EINT_IPEND_IPEND18                                          EINT_IPEND_IPEND18_Msk                                         /*!< Pending bit for line 18 */
#define EINT_IPEND_IPEND19_Pos                                      (19U)
#define EINT_IPEND_IPEND19_Msk                                      (0x1UL << EINT_IPEND_IPEND19_Pos)                              /*!< 0x00080000 */
#define EINT_IPEND_IPEND19                                          EINT_IPEND_IPEND19_Msk                                         /*!< Pending bit for line 19 */
#define EINT_IPEND_IPEND20_Pos                                      (20U)
#define EINT_IPEND_IPEND20_Msk                                      (0x1UL << EINT_IPEND_IPEND20_Pos)                              /*!< 0x00100000 */
#define EINT_IPEND_IPEND20                                          EINT_IPEND_IPEND20_Msk                                         /*!< Pending bit for line 20 */
#define EINT_IPEND_IPEND21_Pos                                      (21U)
#define EINT_IPEND_IPEND21_Msk                                      (0x1UL << EINT_IPEND_IPEND21_Pos)                              /*!< 0x00200000 */
#define EINT_IPEND_IPEND21                                          EINT_IPEND_IPEND21_Msk                                         /*!< Pending bit for line 21 */
#define EINT_IPEND_IPEND22_Pos                                      (22U)
#define EINT_IPEND_IPEND22_Msk                                      (0x1UL << EINT_IPEND_IPEND22_Pos)                              /*!< 0x00400000 */
#define EINT_IPEND_IPEND22                                          EINT_IPEND_IPEND22_Msk                                         /*!< Pending bit for line 22 */

/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for FMC_ACCTRL register  *****************/
#define FLASH_ACCTRL_WAITP_Pos                                      (0U)
#define FLASH_ACCTRL_WAITP_Msk                                      (0x7FUL << FLASH_ACCTRL_WAITP_Pos)                            /*!< 0x0000007F */
#define FLASH_ACCTRL_WAITP                                          FLASH_ACCTRL_WAITP_Msk
#define FLASH_ACCTRL_WAITP_0WS                                      0x00000000U
#define FLASH_ACCTRL_WAITP_1WS                                      0x00000001U
#define FLASH_ACCTRL_WAITP_2WS                                      0x00000002U
#define FLASH_ACCTRL_WAITP_3WS                                      0x00000003U
#define FLASH_ACCTRL_WAITP_4WS                                      0x00000004U
#define FLASH_ACCTRL_WAITP_5WS                                      0x00000005U
#define FLASH_ACCTRL_WAITP_6WS                                      0x00000006U
#define FLASH_ACCTRL_WAITP_7WS                                      0x00000007U
#define FLASH_ACCTRL_WAITP_8WS                                      0x00000008U
#define FLASH_ACCTRL_WAITP_9WS                                      0x00000009U
#define FLASH_ACCTRL_WAITP_10WS                                     0x0000000AU
#define FLASH_ACCTRL_WAITP_11WS                                     0x0000000BU
#define FLASH_ACCTRL_WAITP_12WS                                     0x0000000CU
#define FLASH_ACCTRL_WAITP_13WS                                     0x0000000DU
#define FLASH_ACCTRL_WAITP_14WS                                     0x0000000EU
#define FLASH_ACCTRL_WAITP_15WS                                     0x0000000FU
#define FLASH_ACCTRL_WAITP_16WS                                     0x00000010U
#define FLASH_ACCTRL_WAITP_17WS                                     0x00000011U
#define FLASH_ACCTRL_WAITP_18WS                                     0x00000012U
#define FLASH_ACCTRL_WAITP_19WS                                     0x00000013U
#define FLASH_ACCTRL_WAITP_20WS                                     0x00000014U
#define FLASH_ACCTRL_WAITP_21WS                                     0x00000015U
#define FLASH_ACCTRL_WAITP_22WS                                     0x00000016U
#define FLASH_ACCTRL_WAITP_23WS                                     0x00000017U
#define FLASH_ACCTRL_WAITP_24WS                                     0x00000018U
#define FLASH_ACCTRL_WAITP_25WS                                     0x00000019U
#define FLASH_ACCTRL_WAITP_26WS                                     0x0000001AU
#define FLASH_ACCTRL_WAITP_27WS                                     0x0000001BU
#define FLASH_ACCTRL_WAITP_28WS                                     0x0000001CU
#define FLASH_ACCTRL_WAITP_29WS                                     0x0000001DU
#define FLASH_ACCTRL_WAITP_30WS                                     0x0000001EU
#define FLASH_ACCTRL_WAITP_31WS                                     0x0000001FU
#define FLASH_ACCTRL_WAITP_32WS                                     0x00000020U
#define FLASH_ACCTRL_WAITP_33WS                                     0x00000021U
#define FLASH_ACCTRL_WAITP_34WS                                     0x00000022U
#define FLASH_ACCTRL_WAITP_35WS                                     0x00000023U
#define FLASH_ACCTRL_WAITP_36WS                                     0x00000024U
#define FLASH_ACCTRL_WAITP_37WS                                     0x00000025U
#define FLASH_ACCTRL_WAITP_38WS                                     0x00000026U
#define FLASH_ACCTRL_WAITP_39WS                                     0x00000027U
#define FLASH_ACCTRL_WAITP_40WS                                     0x00000028U
#define FLASH_ACCTRL_WAITP_41WS                                     0x00000029U
#define FLASH_ACCTRL_WAITP_42WS                                     0x0000002AU
#define FLASH_ACCTRL_WAITP_43WS                                     0x0000002BU
#define FLASH_ACCTRL_WAITP_44WS                                     0x0000002CU
#define FLASH_ACCTRL_WAITP_45WS                                     0x0000002DU
#define FLASH_ACCTRL_WAITP_46WS                                     0x0000002EU
#define FLASH_ACCTRL_WAITP_47WS                                     0x0000002FU
#define FLASH_ACCTRL_WAITP_48WS                                     0x00000030U
#define FLASH_ACCTRL_WAITP_49WS                                     0x00000031U
#define FLASH_ACCTRL_WAITP_50WS                                     0x00000032U
#define FLASH_ACCTRL_WAITP_51WS                                     0x00000033U
#define FLASH_ACCTRL_WAITP_52WS                                     0x00000034U
#define FLASH_ACCTRL_WAITP_53WS                                     0x00000035U
#define FLASH_ACCTRL_WAITP_54WS                                     0x00000036U
#define FLASH_ACCTRL_WAITP_55WS                                     0x00000037U
#define FLASH_ACCTRL_WAITP_56WS                                     0x00000038U
#define FLASH_ACCTRL_WAITP_57WS                                     0x00000039U
#define FLASH_ACCTRL_WAITP_58WS                                     0x0000003AU
#define FLASH_ACCTRL_WAITP_59WS                                     0x0000003BU
#define FLASH_ACCTRL_WAITP_60WS                                     0x0000003CU
#define FLASH_ACCTRL_WAITP_61WS                                     0x0000003DU
#define FLASH_ACCTRL_WAITP_62WS                                     0x0000003EU
#define FLASH_ACCTRL_WAITP_63WS                                     0x0000003FU
#define FLASH_ACCTRL_WAITP_64WS                                     0x00000040U
#define FLASH_ACCTRL_WAITP_65WS                                     0x00000041U
#define FLASH_ACCTRL_WAITP_66WS                                     0x00000042U
#define FLASH_ACCTRL_WAITP_67WS                                     0x00000043U
#define FLASH_ACCTRL_WAITP_68WS                                     0x00000044U
#define FLASH_ACCTRL_WAITP_69WS                                     0x00000045U
#define FLASH_ACCTRL_WAITP_70WS                                     0x00000046U
#define FLASH_ACCTRL_WAITP_71WS                                     0x00000047U
#define FLASH_ACCTRL_WAITP_72WS                                     0x00000048U
#define FLASH_ACCTRL_WAITP_73WS                                     0x00000049U
#define FLASH_ACCTRL_WAITP_74WS                                     0x0000004AU
#define FLASH_ACCTRL_WAITP_75WS                                     0x0000004BU
#define FLASH_ACCTRL_WAITP_76WS                                     0x0000004CU
#define FLASH_ACCTRL_WAITP_77WS                                     0x0000004DU
#define FLASH_ACCTRL_WAITP_78WS                                     0x0000004EU
#define FLASH_ACCTRL_WAITP_79WS                                     0x0000004FU
#define FLASH_ACCTRL_WAITP_80WS                                     0x00000050U
#define FLASH_ACCTRL_WAITP_81WS                                     0x00000051U
#define FLASH_ACCTRL_WAITP_82WS                                     0x00000052U
#define FLASH_ACCTRL_WAITP_83WS                                     0x00000053U
#define FLASH_ACCTRL_WAITP_84WS                                     0x00000054U
#define FLASH_ACCTRL_WAITP_85WS                                     0x00000055U
#define FLASH_ACCTRL_WAITP_86WS                                     0x00000056U
#define FLASH_ACCTRL_WAITP_87WS                                     0x00000057U
#define FLASH_ACCTRL_WAITP_88WS                                     0x00000058U
#define FLASH_ACCTRL_WAITP_89WS                                     0x00000059U
#define FLASH_ACCTRL_WAITP_90WS                                     0x0000005AU
#define FLASH_ACCTRL_WAITP_91WS                                     0x0000005BU
#define FLASH_ACCTRL_WAITP_92WS                                     0x0000005CU
#define FLASH_ACCTRL_WAITP_93WS                                     0x0000005DU
#define FLASH_ACCTRL_WAITP_94WS                                     0x0000005EU
#define FLASH_ACCTRL_WAITP_95WS                                     0x0000005FU
#define FLASH_ACCTRL_WAITP_96WS                                     0x00000060U
#define FLASH_ACCTRL_WAITP_97WS                                     0x00000061U
#define FLASH_ACCTRL_WAITP_98WS                                     0x00000062U
#define FLASH_ACCTRL_WAITP_99WS                                     0x00000063U
#define FLASH_ACCTRL_WAITP_100WS                                    0x00000064U
#define FLASH_ACCTRL_WAITP_101WS                                    0x00000065U
#define FLASH_ACCTRL_WAITP_102WS                                    0x00000066U
#define FLASH_ACCTRL_WAITP_103WS                                    0x00000067U
#define FLASH_ACCTRL_WAITP_104WS                                    0x00000068U
#define FLASH_ACCTRL_WAITP_105WS                                    0x00000069U
#define FLASH_ACCTRL_WAITP_106WS                                    0x0000006AU
#define FLASH_ACCTRL_WAITP_107WS                                    0x0000006BU
#define FLASH_ACCTRL_WAITP_108WS                                    0x0000006CU
#define FLASH_ACCTRL_WAITP_109WS                                    0x0000006DU
#define FLASH_ACCTRL_WAITP_110WS                                    0x0000006EU
#define FLASH_ACCTRL_WAITP_111WS                                    0x0000006FU
#define FLASH_ACCTRL_WAITP_112WS                                    0x00000070U
#define FLASH_ACCTRL_WAITP_113WS                                    0x00000071U
#define FLASH_ACCTRL_WAITP_114WS                                    0x00000072U
#define FLASH_ACCTRL_WAITP_115WS                                    0x00000073U
#define FLASH_ACCTRL_WAITP_116WS                                    0x00000074U
#define FLASH_ACCTRL_WAITP_117WS                                    0x00000075U
#define FLASH_ACCTRL_WAITP_118WS                                    0x00000076U
#define FLASH_ACCTRL_WAITP_119WS                                    0x00000077U
#define FLASH_ACCTRL_WAITP_120WS                                    0x00000078U
#define FLASH_ACCTRL_WAITP_121WS                                    0x00000079U
#define FLASH_ACCTRL_WAITP_122WS                                    0x0000007AU
#define FLASH_ACCTRL_WAITP_123WS                                    0x0000007BU
#define FLASH_ACCTRL_WAITP_124WS                                    0x0000007CU
#define FLASH_ACCTRL_WAITP_125WS                                    0x0000007DU
#define FLASH_ACCTRL_WAITP_126WS                                    0x0000007EU
#define FLASH_ACCTRL_WAITP_127WS                                    0x0000007FU

#define FLASH_ACCTRL_PREFEN_Pos                                     (8U)
#define FLASH_ACCTRL_PREFEN_Msk                                     (0x1UL << FLASH_ACCTRL_PREFEN_Pos)                             /*!< 0x00000100 */
#define FLASH_ACCTRL_PREFEN                                         FLASH_ACCTRL_PREFEN_Msk
#define FLASH_ACCTRL_ICACHEEN_Pos                                   (9U)
#define FLASH_ACCTRL_ICACHEEN_Msk                                   (0x1UL << FLASH_ACCTRL_ICACHEEN_Pos)                           /*!< 0x00000200 */
#define FLASH_ACCTRL_ICACHEEN                                       FLASH_ACCTRL_ICACHEEN_Msk
#define FLASH_ACCTRL_DCACHEEN_Pos                                   (10U)
#define FLASH_ACCTRL_DCACHEEN_Msk                                   (0x1UL << FLASH_ACCTRL_DCACHEEN_Pos)                           /*!< 0x00000400 */
#define FLASH_ACCTRL_DCACHEEN                                       FLASH_ACCTRL_DCACHEEN_Msk
#define FLASH_ACCTRL_ICACHERST_Pos                                  (11U)
#define FLASH_ACCTRL_ICACHERST_Msk                                  (0x1UL << FLASH_ACCTRL_ICACHERST_Pos)                          /*!< 0x00000800 */
#define FLASH_ACCTRL_ICACHERST                                      FLASH_ACCTRL_ICACHERST_Msk
#define FLASH_ACCTRL_DCACHERST_Pos                                  (12U)
#define FLASH_ACCTRL_DCACHERST_Msk                                  (0x1UL << FLASH_ACCTRL_DCACHERST_Pos)                          /*!< 0x00001000 */
#define FLASH_ACCTRL_DCACHERST                                      FLASH_ACCTRL_DCACHERST_Msk
#define FLASH_ACCTRL_PREF_TIMING_Pos                                (15U)
#define FLASH_ACCTRL_PREF_TIMING_Msk                                (0x1UL << FLASH_ACCTRL_PREF_TIMING_Pos)                        /*!< 0x00008000 */
#define FLASH_ACCTRL_PREF_TIMING                                    FLASH_ACCTRL_PREF_TIMING_Msk
#define FLASH_ACCTRL_RD_INT_EN_Pos                                  (16U)
#define FLASH_ACCTRL_RD_INT_EN_Msk                                  (0x1UL << FLASH_ACCTRL_RD_INT_EN_Pos)                          /*!< 0x00010000 */
#define FLASH_ACCTRL_RD_INT_EN                                      FLASH_ACCTRL_RD_INT_EN_Msk
#define FLASH_ACCTRL_RD_INT_TIMING_Pos                              (17U)
#define FLASH_ACCTRL_RD_INT_TIMING_Msk                              (0x1UL << FLASH_ACCTRL_RD_INT_TIMING_Pos)                      /*!< 0x00020000 */
#define FLASH_ACCTRL_RD_INT_TIMING                                  FLASH_ACCTRL_RD_INT_TIMING_Msk
#define FLASH_ACCTRL_PIL_Pos                                        (18U)
#define FLASH_ACCTRL_PIL_Msk                                        (0x3UL << FLASH_ACCTRL_PIL_Pos)                                /*!< 0x000C0000 */
#define FLASH_ACCTRL_PIL                                            FLASH_ACCTRL_PIL_Msk
#define FLASH_ACCTRL_PIL_0                                          (0x1UL << FLASH_ACCTRL_PIL_Pos)                                /*!< 0x00040000 */
#define FLASH_ACCTRL_PIL_1                                          (0x2UL << FLASH_ACCTRL_PIL_Pos)                                /*!< 0x00080000 */
#define FLASH_ACCTRL_BYTE0_ADDRESS_Pos                              (10U)
#define FLASH_ACCTRL_BYTE0_ADDRESS_Msk                              (0x10008FUL << FLASH_ACCTRL_BYTE0_ADDRESS_Pos)                 /*!< 0x40023C00 */
#define FLASH_ACCTRL_BYTE0_ADDRESS                                  FLASH_ACCTRL_BYTE0_ADDRESS_Msk
#define FLASH_ACCTRL_BYTE2_ADDRESS_Pos                              (0U)
#define FLASH_ACCTRL_BYTE2_ADDRESS_Msk                              (0x40023C03UL << FLASH_ACCTRL_BYTE2_ADDRESS_Pos)               /*!< 0x40023C03 */
#define FLASH_ACCTRL_BYTE2_ADDRESS                                  FLASH_ACCTRL_BYTE2_ADDRESS_Msk

