kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
#define SMC_IOSTIM4_WAIT4_Pos                                       (8U)
#define SMC_IOSTIM4_WAIT4_Msk                                       (0xFFUL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x0000FF00 */
#define SMC_IOSTIM4_WAIT4                                           SMC_IOSTIM4_WAIT4_Msk                                          /*!<IOWAIT4[7:0] bits (I/O 4 wait time) */
#define SMC_IOSTIM4_WAIT4_0                                         (0x01UL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x00000100 */
#define SMC_IOSTIM4_WAIT4_1                                         (0x02UL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x00000200 */
#define SMC_IOSTIM4_WAIT4_2                                         (0x04UL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x00000400 */
#define SMC_IOSTIM4_WAIT4_3                                         (0x08UL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x00000800 */
#define SMC_IOSTIM4_WAIT4_4                                         (0x10UL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x00001000 */
#define SMC_IOSTIM4_WAIT4_5                                         (0x20UL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x00002000 */
#define SMC_IOSTIM4_WAIT4_6                                         (0x40UL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x00004000 */
#define SMC_IOSTIM4_WAIT4_7                                         (0x80UL << SMC_IOSTIM4_WAIT4_Pos)                              /*!< 0x00008000 */

#define SMC_IOSTIM4_HLD4_Pos                                        (16U)
#define SMC_IOSTIM4_HLD4_Msk                                        (0xFFUL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00FF0000 */
#define SMC_IOSTIM4_HLD4                                            SMC_IOSTIM4_HLD4_Msk                                           /*!<IOHOLD4[7:0] bits (I/O 4 hold time) */
#define SMC_IOSTIM4_HLD4_0                                          (0x01UL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00010000 */
#define SMC_IOSTIM4_HLD4_1                                          (0x02UL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00020000 */
#define SMC_IOSTIM4_HLD4_2                                          (0x04UL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00040000 */
#define SMC_IOSTIM4_HLD4_3                                          (0x08UL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00080000 */
#define SMC_IOSTIM4_HLD4_4                                          (0x10UL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00100000 */
#define SMC_IOSTIM4_HLD4_5                                          (0x20UL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00200000 */
#define SMC_IOSTIM4_HLD4_6                                          (0x40UL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00400000 */
#define SMC_IOSTIM4_HLD4_7                                          (0x80UL << SMC_IOSTIM4_HLD4_Pos)                               /*!< 0x00800000 */

#define SMC_IOSTIM4_HIZ4_Pos                                        (24U)
#define SMC_IOSTIM4_HIZ4_Msk                                        (0xFFUL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0xFF000000 */
#define SMC_IOSTIM4_HIZ4                                            SMC_IOSTIM4_HIZ4_Msk                                           /*!<IOHIZ4[7:0] bits (I/O 4 databus HiZ time) */
#define SMC_IOSTIM4_HIZ4_0                                          (0x01UL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0x01000000 */
#define SMC_IOSTIM4_HIZ4_1                                          (0x02UL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0x02000000 */
#define SMC_IOSTIM4_HIZ4_2                                          (0x04UL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0x04000000 */
#define SMC_IOSTIM4_HIZ4_3                                          (0x08UL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0x08000000 */
#define SMC_IOSTIM4_HIZ4_4                                          (0x10UL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0x10000000 */
#define SMC_IOSTIM4_HIZ4_5                                          (0x20UL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0x20000000 */
#define SMC_IOSTIM4_HIZ4_6                                          (0x40UL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0x40000000 */
#define SMC_IOSTIM4_HIZ4_7                                          (0x80UL << SMC_IOSTIM4_HIZ4_Pos)                               /*!< 0x80000000 */

/******************  Bit definition for SMC_ECCRS2 register  ******************/
#define SMC_ECCRS2_ECCRS2_Pos                                       (0U)
#define SMC_ECCRS2_ECCRS2_Msk                                       (0xFFFFFFFFUL << SMC_ECCRS2_ECCRS2_Pos)                        /*!< 0xFFFFFFFF */
#define SMC_ECCRS2_ECCRS2                                           SMC_ECCRS2_ECCRS2_Msk                                          /*!<ECC result */

/******************  Bit definition for SMC_ECCRS3 register  ******************/
#define SMC_ECCRS3_ECCRS3_Pos                                       (0U)
#define SMC_ECCRS3_ECCRS3_Msk                                       (0xFFFFFFFFUL << SMC_ECCRS3_ECCRS3_Pos)                        /*!< 0xFFFFFFFF */
#define SMC_ECCRS3_ECCRS3                                           SMC_ECCRS3_ECCRS3_Msk                                          /*!<ECC result */

/******************************************************************************/
/*                                                                            */
/*                           Dynamic Memory Controller                        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for DMC_CFG register  ********************/
#define DMC_CFG_BAWCFG_Pos                                          (3U)
#define DMC_CFG_BAWCFG_Msk                                          (0x3UL << DMC_CFG_BAWCFG_Pos)                                  /*!< 0x00000018 */
#define DMC_CFG_BAWCFG                                              DMC_CFG_BAWCFG_Msk
#define DMC_CFG_BAWCFG_0                                            (0x01UL << DMC_CFG_BAWCFG_Pos)                                 /*!< 0x00000008 */
#define DMC_CFG_BAWCFG_1                                            (0x02UL << DMC_CFG_BAWCFG_Pos)                                 /*!< 0x00000010 */
#define DMC_CFG_RAWCFG_Pos                                          (5U)
#define DMC_CFG_RAWCFG_Msk                                          (0xFUL << DMC_CFG_RAWCFG_Pos)                                  /*!< 0x000001E0 */
#define DMC_CFG_RAWCFG                                              DMC_CFG_RAWCFG_Msk
#define DMC_CFG_CAWCFG_Pos                                          (9U)
#define DMC_CFG_CAWCFG_Msk                                          (0xFUL << DMC_CFG_CAWCFG_Pos)                                  /*!< 0x00001E00 */
#define DMC_CFG_CAWCFG                                              DMC_CFG_CAWCFG_Msk
#define DMC_CFG_DWCFG_Pos                                           (13U)
#define DMC_CFG_DWCFG_Msk                                           (0x3UL << DMC_CFG_DWCFG_Pos)                                   /*!< 0x00006000 */
#define DMC_CFG_DWCFG                                               DMC_CFG_DWCFG_Msk
#define DMC_CFG_DWCFG_0                                             (0x01UL << DMC_CFG_DWCFG_Pos)                                  /*!< 0x00002000 */
#define DMC_CFG_DWCFG_1                                             (0x02UL << DMC_CFG_DWCFG_Pos)                                  /*!< 0x00004000 */

/******************  Bit definition for DMC_TIM0 register  ********************/
#define DMC_TIM0_CASLSEL0_Pos                                       (0U)
#define DMC_TIM0_CASLSEL0_Msk                                       (0x3UL << DMC_TIM0_CASLSEL0_Pos)                               /*!< 0x00000003 */
#define DMC_TIM0_CASLSEL0                                           DMC_TIM0_CASLSEL0_Msk
#define DMC_TIM0_RASMINTSEL_Pos                                     (2U)
#define DMC_TIM0_RASMINTSEL_Msk                                     (0xFUL << DMC_TIM0_RASMINTSEL_Pos)                             /*!< 0x0000003C */
#define DMC_TIM0_RASMINTSEL                                         DMC_TIM0_RASMINTSEL_Msk
#define DMC_TIM0_DTIMSEL_Pos                                        (6U)
#define DMC_TIM0_DTIMSEL_Msk                                        (0x7UL << DMC_TIM0_DTIMSEL_Pos)                                /*!< 0x000001C0 */
#define DMC_TIM0_DTIMSEL                                            DMC_TIM0_DTIMSEL_Msk
#define DMC_TIM0_PCPSEL_Pos                                         (9U)
#define DMC_TIM0_PCPSEL_Msk                                         (0x7UL << DMC_TIM0_PCPSEL_Pos)                                 /*!< 0x00000E00 */
#define DMC_TIM0_PCPSEL                                             DMC_TIM0_PCPSEL_Msk
#define DMC_TIM0_WRTIMSEL_Pos                                       (12U)
#define DMC_TIM0_WRTIMSEL_Msk                                       (0x3UL << DMC_TIM0_WRTIMSEL_Pos)                               /*!< 0x00003000 */
#define DMC_TIM0_WRTIMSEL                                           DMC_TIM0_WRTIMSEL_Msk
#define DMC_TIM0_ARPSEL_Pos                                         (14U)
#define DMC_TIM0_ARPSEL_Msk                                         (0xFUL << DMC_TIM0_ARPSEL_Pos)                                 /*!< 0x0003C000 */
#define DMC_TIM0_ARPSEL                                             DMC_TIM0_ARPSEL_Msk
#define DMC_TIM0_XSR0_Pos                                           (18U)
#define DMC_TIM0_XSR0_Msk                                           (0xFUL << DMC_TIM0_XSR0_Pos)                                   /*!< 0x003C0000 */
#define DMC_TIM0_XSR0                                               DMC_TIM0_XSR0_Msk
#define DMC_TIM0_ATACP_Pos                                          (22U)
#define DMC_TIM0_ATACP_Msk                                          (0xFUL << DMC_TIM0_ATACP_Pos)                                  /*!< 0x03C00000 */
#define DMC_TIM0_ATACP                                              DMC_TIM0_ATACP_Msk
#define DMC_TIM0_ECASLSEL1_Pos                                      (26U)
#define DMC_TIM0_ECASLSEL1_Msk                                      (0x1UL << DMC_TIM0_ECASLSEL1_Pos)                              /*!< 0x04000000 */
#define DMC_TIM0_ECASLSEL1                                          DMC_TIM0_ECASLSEL1_Msk
#define DMC_TIM0_EXSR1_Pos                                          (27U)
#define DMC_TIM0_EXSR1_Msk                                          (0x1FUL << DMC_TIM0_EXSR1_Pos)                                 /*!< 0xF8000000 */
#define DMC_TIM0_EXSR1                                              DMC_TIM0_EXSR1_Msk

