kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
/* Legacy defines */
#define GPIO_ALFH_AFRH0                                             GPIO_ALFH_ALFSEL8
#define GPIO_ALFH_AFRH0_0                                           GPIO_ALFH_ALFSEL8_0
#define GPIO_ALFH_AFRH0_1                                           GPIO_ALFH_ALFSEL8_1
#define GPIO_ALFH_AFRH0_2                                           GPIO_ALFH_ALFSEL8_2
#define GPIO_ALFH_AFRH0_3                                           GPIO_ALFH_ALFSEL8_3
#define GPIO_ALFH_AFRH1                                             GPIO_ALFH_ALFSEL9
#define GPIO_ALFH_AFRH1_0                                           GPIO_ALFH_ALFSEL9_0
#define GPIO_ALFH_AFRH1_1                                           GPIO_ALFH_ALFSEL9_1
#define GPIO_ALFH_AFRH1_2                                           GPIO_ALFH_ALFSEL9_2
#define GPIO_ALFH_AFRH1_3                                           GPIO_ALFH_ALFSEL9_3
#define GPIO_ALFH_AFRH2                                             GPIO_ALFH_ALFSEL10
#define GPIO_ALFH_AFRH2_0                                           GPIO_ALFH_ALFSEL10_0
#define GPIO_ALFH_AFRH2_1                                           GPIO_ALFH_ALFSEL10_1
#define GPIO_ALFH_AFRH2_2                                           GPIO_ALFH_ALFSEL10_2
#define GPIO_ALFH_AFRH2_3                                           GPIO_ALFH_ALFSEL10_3
#define GPIO_ALFH_AFRH3                                             GPIO_ALFH_ALFSEL11
#define GPIO_ALFH_AFRH3_0                                           GPIO_ALFH_ALFSEL11_0
#define GPIO_ALFH_AFRH3_1                                           GPIO_ALFH_ALFSEL11_1
#define GPIO_ALFH_AFRH3_2                                           GPIO_ALFH_ALFSEL11_2
#define GPIO_ALFH_AFRH3_3                                           GPIO_ALFH_ALFSEL11_3
#define GPIO_ALFH_AFRH4                                             GPIO_ALFH_ALFSEL12
#define GPIO_ALFH_AFRH4_0                                           GPIO_ALFH_ALFSEL12_0
#define GPIO_ALFH_AFRH4_1                                           GPIO_ALFH_ALFSEL12_1
#define GPIO_ALFH_AFRH4_2                                           GPIO_ALFH_ALFSEL12_2
#define GPIO_ALFH_AFRH4_3                                           GPIO_ALFH_ALFSEL12_3
#define GPIO_ALFH_AFRH5                                             GPIO_ALFH_ALFSEL13
#define GPIO_ALFH_AFRH5_0                                           GPIO_ALFH_ALFSEL13_0
#define GPIO_ALFH_AFRH5_1                                           GPIO_ALFH_ALFSEL13_1
#define GPIO_ALFH_AFRH5_2                                           GPIO_ALFH_ALFSEL13_2
#define GPIO_ALFH_AFRH5_3                                           GPIO_ALFH_ALFSEL13_3
#define GPIO_ALFH_AFRH6                                             GPIO_ALFH_ALFSEL14
#define GPIO_ALFH_AFRH6_0                                           GPIO_ALFH_ALFSEL14_0
#define GPIO_ALFH_AFRH6_1                                           GPIO_ALFH_ALFSEL14_1
#define GPIO_ALFH_AFRH6_2                                           GPIO_ALFH_ALFSEL14_2
#define GPIO_ALFH_AFRH6_3                                           GPIO_ALFH_ALFSEL14_3
#define GPIO_ALFH_AFRH7                                             GPIO_ALFH_ALFSEL15
#define GPIO_ALFH_AFRH7_0                                           GPIO_ALFH_ALFSEL15_0
#define GPIO_ALFH_AFRH7_1                                           GPIO_ALFH_ALFSEL15_1
#define GPIO_ALFH_AFRH7_2                                           GPIO_ALFH_ALFSEL15_2
#define GPIO_ALFH_AFRH7_3                                           GPIO_ALFH_ALFSEL15_3


/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface                    */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CTRL1 register  ********************/
#define I2C_CTRL1_I2CEN_Pos                                         (0U)
#define I2C_CTRL1_I2CEN_Msk                                         (0x1UL << I2C_CTRL1_I2CEN_Pos)                                 /*!< 0x00000001 */
#define I2C_CTRL1_I2CEN                                             I2C_CTRL1_I2CEN_Msk                                            /*!<Peripheral Enable                             */
#define I2C_CTRL1_SMBEN_Pos                                         (1U)
#define I2C_CTRL1_SMBEN_Msk                                         (0x1UL << I2C_CTRL1_SMBEN_Pos)                                 /*!< 0x00000002 */
#define I2C_CTRL1_SMBEN                                             I2C_CTRL1_SMBEN_Msk                                            /*!<SMBus Mode                                    */
#define I2C_CTRL1_SMBTCFG_Pos                                       (3U)
#define I2C_CTRL1_SMBTCFG_Msk                                       (0x1UL << I2C_CTRL1_SMBTCFG_Pos)                               /*!< 0x00000008 */
#define I2C_CTRL1_SMBTCFG                                           I2C_CTRL1_SMBTCFG_Msk                                          /*!<SMBus Type                                    */
#define I2C_CTRL1_ARPEN_Pos                                         (4U)
#define I2C_CTRL1_ARPEN_Msk                                         (0x1UL << I2C_CTRL1_ARPEN_Pos)                                 /*!< 0x00000010 */
#define I2C_CTRL1_ARPEN                                             I2C_CTRL1_ARPEN_Msk                                            /*!<ARP Enable                                    */
#define I2C_CTRL1_PECEN_Pos                                         (5U)
#define I2C_CTRL1_PECEN_Msk                                         (0x1UL << I2C_CTRL1_PECEN_Pos)                                 /*!< 0x00000020 */
#define I2C_CTRL1_PECEN                                             I2C_CTRL1_PECEN_Msk                                            /*!<PEC Enable                                    */
#define I2C_CTRL1_SRBEN_Pos                                         (6U)
#define I2C_CTRL1_SRBEN_Msk                                         (0x1UL << I2C_CTRL1_SRBEN_Pos)                                 /*!< 0x00000040 */
#define I2C_CTRL1_SRBEN                                             I2C_CTRL1_SRBEN_Msk                                            /*!<General Call Enable                           */
#define I2C_CTRL1_CLKSTRETCHD_Pos                                   (7U)
#define I2C_CTRL1_CLKSTRETCHD_Msk                                   (0x1UL << I2C_CTRL1_CLKSTRETCHD_Pos)                           /*!< 0x00000080 */
#define I2C_CTRL1_CLKSTRETCHD                                       I2C_CTRL1_CLKSTRETCHD_Msk                                      /*!<Clock Stretching Disable (Slave mode)         */
#define I2C_CTRL1_START_Pos                                         (8U)
#define I2C_CTRL1_START_Msk                                         (0x1UL << I2C_CTRL1_START_Pos)                                 /*!< 0x00000100 */
#define I2C_CTRL1_START                                             I2C_CTRL1_START_Msk                                            /*!<Start Generation                              */
#define I2C_CTRL1_STOP_Pos                                          (9U)
#define I2C_CTRL1_STOP_Msk                                          (0x1UL << I2C_CTRL1_STOP_Pos)                                  /*!< 0x00000200 */
#define I2C_CTRL1_STOP                                              I2C_CTRL1_STOP_Msk                                             /*!<Stop Generation                               */
#define I2C_CTRL1_ACKEN_Pos                                         (10U)
#define I2C_CTRL1_ACKEN_Msk                                         (0x1UL << I2C_CTRL1_ACKEN_Pos)                                 /*!< 0x00000400 */
#define I2C_CTRL1_ACKEN                                             I2C_CTRL1_ACKEN_Msk                                            /*!<Acknowledge Enable                            */
#define I2C_CTRL1_ACKPOS_Pos                                        (11U)
#define I2C_CTRL1_ACKPOS_Msk                                        (0x1UL << I2C_CTRL1_ACKPOS_Pos)                                /*!< 0x00000800 */
#define I2C_CTRL1_ACKPOS                                            I2C_CTRL1_ACKPOS_Msk                                           /*!<Acknowledge/PEC Position (for data reception) */
#define I2C_CTRL1_PEC_Pos                                           (12U)
#define I2C_CTRL1_PEC_Msk                                           (0x1UL << I2C_CTRL1_PEC_Pos)                                   /*!< 0x00001000 */
#define I2C_CTRL1_PEC                                               I2C_CTRL1_PEC_Msk                                              /*!<Packet Error Checking                         */
#define I2C_CTRL1_ALERTEN_Pos                                       (13U)
#define I2C_CTRL1_ALERTEN_Msk                                       (0x1UL << I2C_CTRL1_ALERTEN_Pos)                               /*!< 0x00002000 */
#define I2C_CTRL1_ALERTEN                                           I2C_CTRL1_ALERTEN_Msk                                          /*!<SMBus Alert                                   */
#define I2C_CTRL1_SWRST_Pos                                         (15U)
#define I2C_CTRL1_SWRST_Msk                                         (0x1UL << I2C_CTRL1_SWRST_Pos)                                 /*!< 0x00008000 */
#define I2C_CTRL1_SWRST                                             I2C_CTRL1_SWRST_Msk                                            /*!<Software Reset                                */

/*******************  Bit definition for I2C_CTRL2 register  ********************/
#define I2C_CTRL2_CLKFCFG_Pos                                       (0U)
#define I2C_CTRL2_CLKFCFG_Msk                                       (0x3FUL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x0000003F */
#define I2C_CTRL2_CLKFCFG                                           I2C_CTRL2_CLKFCFG_Msk                                          /*!<FREQ[5:0] bits (Peripheral Clock Frequency)   */
#define I2C_CTRL2_CLKFCFG_0                                         (0x01UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000001 */
#define I2C_CTRL2_CLKFCFG_1                                         (0x02UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000002 */
#define I2C_CTRL2_CLKFCFG_2                                         (0x04UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000004 */
#define I2C_CTRL2_CLKFCFG_3                                         (0x08UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000008 */
#define I2C_CTRL2_CLKFCFG_4                                         (0x10UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000010 */
#define I2C_CTRL2_CLKFCFG_5                                         (0x20UL << I2C_CTRL2_CLKFCFG_Pos)                              /*!< 0x00000020 */

