kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
/******************  Bit definition for SDIO_MASK register  *******************/
#define SDIO_MASK_CCRCFAIL_Pos                                      (0U)
#define SDIO_MASK_CCRCFAIL_Msk                                      (0x1UL << SDIO_MASK_CCRCFAIL_Pos)                              /*!< 0x00000001 */
#define SDIO_MASK_CCRCFAIL                                          SDIO_MASK_CCRCFAIL_Msk                                         /*!<Command CRC Fail Interrupt Enable          */
#define SDIO_MASK_DCRCFAIL_Pos                                      (1U)
#define SDIO_MASK_DCRCFAIL_Msk                                      (0x1UL << SDIO_MASK_DCRCFAIL_Pos)                              /*!< 0x00000002 */
#define SDIO_MASK_DCRCFAIL                                          SDIO_MASK_DCRCFAIL_Msk                                         /*!<Data CRC Fail Interrupt Enable             */
#define SDIO_MASK_CMDTO_Pos                                         (2U)
#define SDIO_MASK_CMDTO_Msk                                         (0x1UL << SDIO_MASK_CMDTO_Pos)                                 /*!< 0x00000004 */
#define SDIO_MASK_CMDTO                                             SDIO_MASK_CMDTO_Msk                                            /*!<Command TimeOut Interrupt Enable           */
#define SDIO_MASK_DATATO_Pos                                        (3U)
#define SDIO_MASK_DATATO_Msk                                        (0x1UL << SDIO_MASK_DATATO_Pos)                                /*!< 0x00000008 */
#define SDIO_MASK_DATATO                                            SDIO_MASK_DATATO_Msk                                           /*!<Data TimeOut Interrupt Enable              */
#define SDIO_MASK_TXURER_Pos                                        (4U)
#define SDIO_MASK_TXURER_Msk                                        (0x1UL << SDIO_MASK_TXURER_Pos)                                /*!< 0x00000010 */
#define SDIO_MASK_TXURER                                            SDIO_MASK_TXURER_Msk                                           /*!<Tx FIFO UnderRun Error Interrupt Enable    */
#define SDIO_MASK_RXORER_Pos                                        (5U)
#define SDIO_MASK_RXORER_Msk                                        (0x1UL << SDIO_MASK_RXORER_Pos)                                /*!< 0x00000020 */
#define SDIO_MASK_RXORER                                            SDIO_MASK_RXORER_Msk                                           /*!<Rx FIFO OverRun Error Interrupt Enable     */
#define SDIO_MASK_CMDRESRC_Pos                                      (6U)
#define SDIO_MASK_CMDRESRC_Msk                                      (0x1UL << SDIO_MASK_CMDRESRC_Pos)                              /*!< 0x00000040 */
#define SDIO_MASK_CMDRESRC                                          SDIO_MASK_CMDRESRC_Msk                                         /*!<Command Response Received Interrupt Enable */
#define SDIO_MASK_CMDSENT_Pos                                       (7U)
#define SDIO_MASK_CMDSENT_Msk                                       (0x1UL << SDIO_MASK_CMDSENT_Pos)                               /*!< 0x00000080 */
#define SDIO_MASK_CMDSENT                                           SDIO_MASK_CMDSENT_Msk                                          /*!<Command Sent Interrupt Enable              */
#define SDIO_MASK_DATAEND_Pos                                       (8U)
#define SDIO_MASK_DATAEND_Msk                                       (0x1UL << SDIO_MASK_DATAEND_Pos)                               /*!< 0x00000100 */
#define SDIO_MASK_DATAEND                                           SDIO_MASK_DATAEND_Msk                                          /*!<Data End Interrupt Enable                  */
#define SDIO_MASK_STRTER_Pos                                        (9U)
#define SDIO_MASK_STRTER_Msk                                        (0x1UL << SDIO_MASK_STRTER_Pos)                                /*!< 0x00000200 */
#define SDIO_MASK_STRTER                                            SDIO_MASK_STRTER_Msk                                           /*!<Start Bit Error Interrupt Enable           */
#define SDIO_MASK_DBEND_Pos                                         (10U)
#define SDIO_MASK_DBEND_Msk                                         (0x1UL << SDIO_MASK_DBEND_Pos)                                 /*!< 0x00000400 */
#define SDIO_MASK_DBEND                                             SDIO_MASK_DBEND_Msk                                            /*!<Data Block End Interrupt Enable            */
#define SDIO_MASK_CMDACT_Pos                                        (11U)
#define SDIO_MASK_CMDACT_Msk                                        (0x1UL << SDIO_MASK_CMDACT_Pos)                                /*!< 0x00000800 */
#define SDIO_MASK_CMDACT                                            SDIO_MASK_CMDACT_Msk                                           /*!<CCommand Acting Interrupt Enable           */
#define SDIO_MASK_TXACT_Pos                                         (12U)
#define SDIO_MASK_TXACT_Msk                                         (0x1UL << SDIO_MASK_TXACT_Pos)                                 /*!< 0x00001000 */
#define SDIO_MASK_TXACT                                             SDIO_MASK_TXACT_Msk                                            /*!<Data Transmit Acting Interrupt Enable      */
#define SDIO_MASK_RXACT_Pos                                         (13U)
#define SDIO_MASK_RXACT_Msk                                         (0x1UL << SDIO_MASK_RXACT_Pos)                                 /*!< 0x00002000 */
#define SDIO_MASK_RXACT                                             SDIO_MASK_RXACT_Msk                                            /*!<Data receive acting interrupt enabled      */
#define SDIO_MASK_TXHFERT_Pos                                       (14U)
#define SDIO_MASK_TXHFERT_Msk                                       (0x1UL << SDIO_MASK_TXHFERT_Pos)                               /*!< 0x00004000 */
#define SDIO_MASK_TXHFERT                                           SDIO_MASK_TXHFERT_Msk                                          /*!<Tx FIFO Half Empty interrupt Enable        */
#define SDIO_MASK_RXHFFUL_Pos                                       (15U)
#define SDIO_MASK_RXHFFUL_Msk                                       (0x1UL << SDIO_MASK_RXHFFUL_Pos)                               /*!< 0x00008000 */
#define SDIO_MASK_RXHFFUL                                           SDIO_MASK_RXHFFUL_Msk                                          /*!<Rx FIFO Half Full interrupt Enable         */
#define SDIO_MASK_TXFUL_Pos                                         (16U)
#define SDIO_MASK_TXFUL_Msk                                         (0x1UL << SDIO_MASK_TXFUL_Pos)                                 /*!< 0x00010000 */
#define SDIO_MASK_TXFUL                                             SDIO_MASK_TXFUL_Msk                                            /*!<Tx FIFO Full interrupt Enable              */
#define SDIO_MASK_RXFUL_Pos                                         (17U)
#define SDIO_MASK_RXFUL_Msk                                         (0x1UL << SDIO_MASK_RXFUL_Pos)                                 /*!< 0x00020000 */
#define SDIO_MASK_RXFUL                                             SDIO_MASK_RXFUL_Msk                                            /*!<Rx FIFO Full interrupt Enable              */
#define SDIO_MASK_TXEPT_Pos                                         (18U)
#define SDIO_MASK_TXEPT_Msk                                         (0x1UL << SDIO_MASK_TXEPT_Pos)                                 /*!< 0x00040000 */
#define SDIO_MASK_TXEPT                                             SDIO_MASK_TXEPT_Msk                                            /*!<Tx FIFO Empty interrupt Enable             */
#define SDIO_MASK_RXFEIE_Pos                                        (19U)
#define SDIO_MASK_RXFEIE_Msk                                        (0x1UL << SDIO_MASK_RXFEIE_Pos)                                /*!< 0x00080000 */
#define SDIO_MASK_RXFEIE                                            SDIO_MASK_RXFEIE_Msk                                           /*!<Rx FIFO Empty interrupt Enable             */
#define SDIO_MASK_TXDAVB_Pos                                        (20U)
#define SDIO_MASK_TXDAVB_Msk                                        (0x1UL << SDIO_MASK_TXDAVB_Pos)                                /*!< 0x00100000 */
#define SDIO_MASK_TXDAVB                                            SDIO_MASK_TXDAVB_Msk                                           /*!<Data available in Tx FIFO interrupt Enable */
#define SDIO_MASK_RXDAVB_Pos                                        (21U)
#define SDIO_MASK_RXDAVB_Msk                                        (0x1UL << SDIO_MASK_RXDAVB_Pos)                                /*!< 0x00200000 */
#define SDIO_MASK_RXDAVB                                            SDIO_MASK_RXDAVB_Msk                                           /*!<Data available in Rx FIFO interrupt Enable */
#define SDIO_MASK_SDIOINTREC_Pos                                    (22U)
#define SDIO_MASK_SDIOINTREC_Msk                                    (0x1UL << SDIO_MASK_SDIOINTREC_Pos)                            /*!< 0x00400000 */
#define SDIO_MASK_SDIOINTREC                                        SDIO_MASK_SDIOINTREC_Msk                                       /*!<SDIO Mode Interrupt Received interrupt Enable */
#define SDIO_MASK_ATACLPREC_Pos                                     (23U)
#define SDIO_MASK_ATACLPREC_Msk                                     (0x1UL << SDIO_MASK_ATACLPREC_Pos)                             /*!< 0x00800000 */
#define SDIO_MASK_ATACLPREC                                         SDIO_MASK_ATACLPREC_Msk                                        /*!<CE-ATA command completion signal received Interrupt Enable */

/*****************  Bit definition for SDIO_FIFOCNT register  *****************/
#define SDIO_FIFOCNT_FIFOCNT_Pos                                    (0U)
#define SDIO_FIFOCNT_FIFOCNT_Msk                                    (0xFFFFFFUL << SDIO_FIFOCNT_FIFOCNT_Pos)                       /*!< 0x00FFFFFF */
#define SDIO_FIFOCNT_FIFOCNT                                        SDIO_FIFOCNT_FIFOCNT_Msk                                       /*!<Remaining number of words to be written to or read from the FIFO */

/******************  Bit definition for SDIO_FIFODATA register  *******************/
#define SDIO_FIFODATA_DATA_Pos                                      (0U)
#define SDIO_FIFODATA_DATA_Msk                                      (0xFFFFFFFFUL << SDIO_FIFODATA_DATA_Pos)                       /*!< 0xFFFFFFFF */
#define SDIO_FIFODATA_DATA                                          SDIO_FIFODATA_DATA_Msk                                         /*!<Receive and transmit FIFO data */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for SPI_CTRL1 register  ********************/
#define SPI_CTRL1_CPHA_Pos                                          (0U)
#define SPI_CTRL1_CPHA_Msk                                          (0x1UL << SPI_CTRL1_CPHA_Pos)                                  /*!< 0x00000001 */
#define SPI_CTRL1_CPHA                                              SPI_CTRL1_CPHA_Msk                                             /*!<Clock Phase      */
#define SPI_CTRL1_CPOL_Pos                                          (1U)
#define SPI_CTRL1_CPOL_Msk                                          (0x1UL << SPI_CTRL1_CPOL_Pos)                                  /*!< 0x00000002 */
#define SPI_CTRL1_CPOL                                              SPI_CTRL1_CPOL_Msk                                             /*!<Clock Polarity   */
#define SPI_CTRL1_MSMCFG_Pos                                        (2U)
#define SPI_CTRL1_MSMCFG_Msk                                        (0x1UL << SPI_CTRL1_MSMCFG_Pos)                                /*!< 0x00000004 */
#define SPI_CTRL1_MSMCFG                                            SPI_CTRL1_MSMCFG_Msk                                           /*!<Master Selection */

#define SPI_CTRL1_BRSEL_Pos                                         (3U)
#define SPI_CTRL1_BRSEL_Msk                                         (0x7UL << SPI_CTRL1_BRSEL_Pos)                                 /*!< 0x00000038 */
#define SPI_CTRL1_BRSEL                                             SPI_CTRL1_BRSEL_Msk                                            /*!<BR[2:0] bits (Baud Rate Control) */
#define SPI_CTRL1_BRSEL_0                                           (0x1UL << SPI_CTRL1_BRSEL_Pos)                                 /*!< 0x00000008 */
#define SPI_CTRL1_BRSEL_1                                           (0x2UL << SPI_CTRL1_BRSEL_Pos)                                 /*!< 0x00000010 */
#define SPI_CTRL1_BRSEL_2                                           (0x4UL << SPI_CTRL1_BRSEL_Pos)                                 /*!< 0x00000020 */

#define SPI_CTRL1_SPIEN_Pos                                         (6U)
#define SPI_CTRL1_SPIEN_Msk                                         (0x1UL << SPI_CTRL1_SPIEN_Pos)                                 /*!< 0x00000040 */
#define SPI_CTRL1_SPIEN                                             SPI_CTRL1_SPIEN_Msk                                            /*!<SPI Enable                          */
#define SPI_CTRL1_LSBSEL_Pos                                        (7U)
#define SPI_CTRL1_LSBSEL_Msk                                        (0x1UL << SPI_CTRL1_LSBSEL_Pos)                                /*!< 0x00000080 */
#define SPI_CTRL1_LSBSEL                                            SPI_CTRL1_LSBSEL_Msk                                           /*!<Frame Format                        */
#define SPI_CTRL1_ISSEL_Pos                                         (8U)
#define SPI_CTRL1_ISSEL_Msk                                         (0x1UL << SPI_CTRL1_ISSEL_Pos)                                 /*!< 0x00000100 */
#define SPI_CTRL1_ISSEL                                             SPI_CTRL1_ISSEL_Msk                                            /*!<Internal slave select               */
#define SPI_CTRL1_SSEN_Pos                                          (9U)
#define SPI_CTRL1_SSEN_Msk                                          (0x1UL << SPI_CTRL1_SSEN_Pos)                                  /*!< 0x00000200 */
#define SPI_CTRL1_SSEN                                              SPI_CTRL1_SSEN_Msk                                             /*!<Software slave management           */
#define SPI_CTRL1_RXOMEN_Pos                                        (10U)
#define SPI_CTRL1_RXOMEN_Msk                                        (0x1UL << SPI_CTRL1_RXOMEN_Pos)                                /*!< 0x00000400 */
#define SPI_CTRL1_RXOMEN                                            SPI_CTRL1_RXOMEN_Msk                                           /*!<Receive only                        */
#define SPI_CTRL1_DFLSEL_Pos                                        (11U)
#define SPI_CTRL1_DFLSEL_Msk                                        (0x1UL << SPI_CTRL1_DFLSEL_Pos)                                /*!< 0x00000800 */
#define SPI_CTRL1_DFLSEL                                            SPI_CTRL1_DFLSEL_Msk                                           /*!<Data Frame Format                   */
#define SPI_CTRL1_CRCNXT_Pos                                        (12U)
#define SPI_CTRL1_CRCNXT_Msk                                        (0x1UL << SPI_CTRL1_CRCNXT_Pos)                                /*!< 0x00001000 */
#define SPI_CTRL1_CRCNXT                                            SPI_CTRL1_CRCNXT_Msk                                           /*!<Transmit CRC next                   */
#define SPI_CTRL1_CRCEN_Pos                                         (13U)
#define SPI_CTRL1_CRCEN_Msk                                         (0x1UL << SPI_CTRL1_CRCEN_Pos)                                 /*!< 0x00002000 */
#define SPI_CTRL1_CRCEN                                             SPI_CTRL1_CRCEN_Msk                                            /*!<Hardware CRC calculation enable     */
#define SPI_CTRL1_BMOEN_Pos                                         (14U)
#define SPI_CTRL1_BMOEN_Msk                                         (0x1UL << SPI_CTRL1_BMOEN_Pos)                                 /*!< 0x00004000 */
#define SPI_CTRL1_BMOEN                                             SPI_CTRL1_BMOEN_Msk                                            /*!<Output enable in bidirectional mode */
#define SPI_CTRL1_BMEN_Pos                                          (15U)
#define SPI_CTRL1_BMEN_Msk                                          (0x1UL << SPI_CTRL1_BMEN_Pos)                                  /*!< 0x00008000 */
#define SPI_CTRL1_BMEN                                              SPI_CTRL1_BMEN_Msk                                             /*!<Bidirectional data mode enable      */

