kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
/*******************  Bit definition for TMR_CEG register  ********************/
#define TMR_CEG_UEG_Pos                                             (0U)
#define TMR_CEG_UEG_Msk                                             (0x1UL << TMR_CEG_UEG_Pos)                                     /*!< 0x00000001 */
#define TMR_CEG_UEG                                                 TMR_CEG_UEG_Msk                                                /*!<Update Generation                         */
#define TMR_CEG_CC1EG_Pos                                           (1U)
#define TMR_CEG_CC1EG_Msk                                           (0x1UL << TMR_CEG_CC1EG_Pos)                                   /*!< 0x00000002 */
#define TMR_CEG_CC1EG                                               TMR_CEG_CC1EG_Msk                                              /*!<Capture/Compare 1 Generation              */
#define TMR_CEG_CC2EG_Pos                                           (2U)
#define TMR_CEG_CC2EG_Msk                                           (0x1UL << TMR_CEG_CC2EG_Pos)                                   /*!< 0x00000004 */
#define TMR_CEG_CC2EG                                               TMR_CEG_CC2EG_Msk                                              /*!<Capture/Compare 2 Generation              */
#define TMR_CEG_CC3EG_Pos                                           (3U)
#define TMR_CEG_CC3EG_Msk                                           (0x1UL << TMR_CEG_CC3EG_Pos)                                   /*!< 0x00000008 */
#define TMR_CEG_CC3EG                                               TMR_CEG_CC3EG_Msk                                              /*!<Capture/Compare 3 Generation              */
#define TMR_CEG_CC4EG_Pos                                           (4U)
#define TMR_CEG_CC4EG_Msk                                           (0x1UL << TMR_CEG_CC4EG_Pos)                                   /*!< 0x00000010 */
#define TMR_CEG_CC4EG                                               TMR_CEG_CC4EG_Msk                                              /*!<Capture/Compare 4 Generation              */
#define TMR_CEG_COMG_Pos                                            (5U)
#define TMR_CEG_COMG_Msk                                            (0x1UL << TMR_CEG_COMG_Pos)                                    /*!< 0x00000020 */
#define TMR_CEG_COMG                                                TMR_CEG_COMG_Msk                                               /*!<Capture/Compare Control Update Generation */
#define TMR_CEG_TEG_Pos                                             (6U)
#define TMR_CEG_TEG_Msk                                             (0x1UL << TMR_CEG_TEG_Pos)                                     /*!< 0x00000040 */
#define TMR_CEG_TEG                                                 TMR_CEG_TEG_Msk                                                /*!<Trigger Generation                        */
#define TMR_CEG_BEG_Pos                                             (7U)
#define TMR_CEG_BEG_Msk                                             (0x1UL << TMR_CEG_BEG_Pos)                                     /*!< 0x00000080 */
#define TMR_CEG_BEG                                                 TMR_CEG_BEG_Msk                                                /*!<Break Generation                          */

/******************  Bit definition for TMR_CCM1 register  *******************/
#define TMR_CCM1_CC1SEL_Pos                                         (0U)
#define TMR_CCM1_CC1SEL_Msk                                         (0x3UL << TMR_CCM1_CC1SEL_Pos)                                 /*!< 0x00000003 */
#define TMR_CCM1_CC1SEL                                             TMR_CCM1_CC1SEL_Msk                                            /*!<CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define TMR_CCM1_CC1SEL_0                                           (0x1UL << TMR_CCM1_CC1SEL_Pos)                                 /*!< 0x0001 */
#define TMR_CCM1_CC1SEL_1                                           (0x2UL << TMR_CCM1_CC1SEL_Pos)                                 /*!< 0x0002 */

#define TMR_CCM1_OC1FEN_Pos                                         (2U)
#define TMR_CCM1_OC1FEN_Msk                                         (0x1UL << TMR_CCM1_OC1FEN_Pos)                                 /*!< 0x00000004 */
#define TMR_CCM1_OC1FEN                                             TMR_CCM1_OC1FEN_Msk                                            /*!<Output Compare 1 Fast enable                 */
#define TMR_CCM1_OC1PEN_Pos                                         (3U)
#define TMR_CCM1_OC1PEN_Msk                                         (0x1UL << TMR_CCM1_OC1PEN_Pos)                                 /*!< 0x00000008 */
#define TMR_CCM1_OC1PEN                                             TMR_CCM1_OC1PEN_Msk                                            /*!<Output Compare 1 Preload enable              */

#define TMR_CCM1_OC1MOD_Pos                                         (4U)
#define TMR_CCM1_OC1MOD_Msk                                         (0x7UL << TMR_CCM1_OC1MOD_Pos)                                 /*!< 0x00000070 */
#define TMR_CCM1_OC1MOD                                             TMR_CCM1_OC1MOD_Msk                                            /*!<OC1M[2:0] bits (Output Compare 1 Mode)       */
#define TMR_CCM1_OC1MOD_0                                           (0x1UL << TMR_CCM1_OC1MOD_Pos)                                 /*!< 0x0010 */
#define TMR_CCM1_OC1MOD_1                                           (0x2UL << TMR_CCM1_OC1MOD_Pos)                                 /*!< 0x0020 */
#define TMR_CCM1_OC1MOD_2                                           (0x4UL << TMR_CCM1_OC1MOD_Pos)                                 /*!< 0x0040 */

#define TMR_CCM1_OC1CEN_Pos                                         (7U)
#define TMR_CCM1_OC1CEN_Msk                                         (0x1UL << TMR_CCM1_OC1CEN_Pos)                                 /*!< 0x00000080 */
#define TMR_CCM1_OC1CEN                                             TMR_CCM1_OC1CEN_Msk                                            /*!<Output Compare 1Clear Enable                 */

#define TMR_CCM1_CC2SEL_Pos                                         (8U)
#define TMR_CCM1_CC2SEL_Msk                                         (0x3UL << TMR_CCM1_CC2SEL_Pos)                                 /*!< 0x00000300 */
#define TMR_CCM1_CC2SEL                                             TMR_CCM1_CC2SEL_Msk                                            /*!<CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define TMR_CCM1_CC2SEL_0                                           (0x1UL << TMR_CCM1_CC2SEL_Pos)                                 /*!< 0x0100 */
#define TMR_CCM1_CC2SEL_1                                           (0x2UL << TMR_CCM1_CC2SEL_Pos)                                 /*!< 0x0200 */

