kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
/* Bit definition for Ethernet MAC Interrupt Mask Register */
#define ETH_MACIMASK_TSTIM_Pos                                      (9U)
#define ETH_MACIMASK_TSTIM_Msk                                      (0x1UL << ETH_MACIMASK_TSTIM_Pos)                              /*!< 0x00000200 */
#define ETH_MACIMASK_TSTIM                                          ETH_MACIMASK_TSTIM_Msk                                         /* Time stamp trigger interrupt mask */
#define ETH_MACIMASK_PMTIM_Pos                                      (3U)
#define ETH_MACIMASK_PMTIM_Msk                                      (0x1UL << ETH_MACIMASK_PMTIM_Pos)                              /*!< 0x00000008 */
#define ETH_MACIMASK_PMTIM                                          ETH_MACIMASK_PMTIM_Msk                                         /* PMT interrupt mask                */

/* Bit definition for Ethernet MAC Address0 High Register */
#define ETH_MACADDR0H_ADDR0H_Pos                                    (0U)
#define ETH_MACADDR0H_ADDR0H_Msk                                    (0xFFFFUL << ETH_MACADDR0H_ADDR0H_Pos)                         /*!< 0x0000FFFF */
#define ETH_MACADDR0H_ADDR0H                                        ETH_MACADDR0H_ADDR0H_Msk                                       /* MAC address0 high */

/* Bit definition for Ethernet MAC Address0 Low Register */
#define ETH_MACADDR0L_ADDR0L_Pos                                    (0U)
#define ETH_MACADDR0L_ADDR0L_Msk                                    (0xFFFFFFFFUL << ETH_MACADDR0L_ADDR0L_Pos)                     /*!< 0xFFFFFFFF */
#define ETH_MACADDR0L_ADDR0L                                        ETH_MACADDR0L_ADDR0L_Msk                                       /* MAC address0 low */

/* Bit definition for Ethernet MAC Address1 High Register */
#define ETH_MACADDR1H_ADDREN_Pos                                    (31U)
#define ETH_MACADDR1H_ADDREN_Msk                                    (0x1UL << ETH_MACADDR1H_ADDREN_Pos)                            /*!< 0x80000000 */
#define ETH_MACADDR1H_ADDREN                                        ETH_MACADDR1H_ADDREN_Msk                                       /* Address enable */
#define ETH_MACADDR1H_ADDRSEL_Pos                                   (30U)
#define ETH_MACADDR1H_ADDRSEL_Msk                                   (0x1UL << ETH_MACADDR1H_ADDRSEL_Pos)                           /*!< 0x40000000 */
#define ETH_MACADDR1H_ADDRSEL                                       ETH_MACADDR1H_ADDRSEL_Msk                                      /* Source address */
#define ETH_MACADDR1H_MASKBCTRL_Pos                                 (24U)
#define ETH_MACADDR1H_MASKBCTRL_Msk                                 (0x3FUL << ETH_MACADDR1H_MASKBCTRL_Pos)                        /*!< 0x3F000000 */
#define ETH_MACADDR1H_MASKBCTRL                                     ETH_MACADDR1H_MASKBCTRL_Msk                                    /* Mask byte control: bits to mask for comparison of the MAC Address bytes */
#define ETH_MACADDR1H_MASKBCTRL_HBits15_8                           0x20000000U                                                    /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACADDR1H_MASKBCTRL_HBits7_0                            0x10000000U                                                    /* Mask MAC Address high reg bits [7:0]  */
#define ETH_MACADDR1H_MASKBCTRL_LBits31_24                          0x08000000U                                                    /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACADDR1H_MASKBCTRL_LBits23_16                          0x04000000U                                                    /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACADDR1H_MASKBCTRL_LBits15_8                           0x02000000U                                                    /* Mask MAC Address low reg bits [15:8]  */
#define ETH_MACADDR1H_MASKBCTRL_LBits7_0                            0x01000000U                                                    /* Mask MAC Address low reg bits [7:0]   */
#define ETH_MACADDR1H_ADDR1H_Pos                                    (0U)
#define ETH_MACADDR1H_ADDR1H_Msk                                    (0xFFFFUL << ETH_MACADDR1H_ADDR1H_Pos)                         /*!< 0x0000FFFF */
#define ETH_MACADDR1H_ADDR1H                                        ETH_MACADDR1H_ADDR1H_Msk                                       /* MAC address1 high */

/* Bit definition for Ethernet MAC Address1 Low Register */
#define ETH_MACADDR1L_ADDR1L_Pos                                    (0U)
#define ETH_MACADDR1L_ADDR1L_Msk                                    (0xFFFFFFFFUL << ETH_MACADDR1L_ADDR1L_Pos)                     /*!< 0xFFFFFFFF */
#define ETH_MACADDR1L_ADDR1L                                        ETH_MACADDR1L_ADDR1L_Msk                                       /* MAC address1 low */

/* Bit definition for Ethernet MAC Address2 High Register */
#define ETH_MACADDR2H_ADDREN_Pos                                    (31U)
#define ETH_MACADDR2H_ADDREN_Msk                                    (0x1UL << ETH_MACADDR2H_ADDREN_Pos)                            /*!< 0x80000000 */
#define ETH_MACADDR2H_ADDREN                                        ETH_MACADDR2H_ADDREN_Msk                                       /* Address enable */
#define ETH_MACADDR2H_ADDRSEL_Pos                                   (30U)
#define ETH_MACADDR2H_ADDRSEL_Msk                                   (0x1UL << ETH_MACADDR2H_ADDRSEL_Pos)                           /*!< 0x40000000 */
#define ETH_MACADDR2H_ADDRSEL                                       ETH_MACADDR2H_ADDRSEL_Msk                                      /* Source address */
#define ETH_MACADDR2H_MASKBCTRL_Pos                                 (24U)
#define ETH_MACADDR2H_MASKBCTRL_Msk                                 (0x3FUL << ETH_MACADDR2H_MASKBCTRL_Pos)                        /*!< 0x3F000000 */
#define ETH_MACADDR2H_MASKBCTRL                                     ETH_MACADDR2H_MASKBCTRL_Msk                                    /* Mask byte control */
#define ETH_MACADDR2H_MASKBCTRL_HBits15_8                           0x20000000U                                                    /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACADDR2H_MASKBCTRL_HBits7_0                            0x10000000U                                                    /* Mask MAC Address high reg bits [7:0]  */
#define ETH_MACADDR2H_MASKBCTRL_LBits31_24                          0x08000000U                                                    /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACADDR2H_MASKBCTRL_LBits23_16                          0x04000000U                                                    /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACADDR2H_MASKBCTRL_LBits15_8                           0x02000000U                                                    /* Mask MAC Address low reg bits [15:8]  */
#define ETH_MACADDR2H_MASKBCTRL_LBits7_0                            0x01000000U                                                    /* Mask MAC Address low reg bits [70]    */
#define ETH_MACADDR2H_ADDR2H_Pos                                    (0U)
#define ETH_MACADDR2H_ADDR2H_Msk                                    (0xFFFFUL << ETH_MACADDR2H_ADDR2H_Pos)                         /*!< 0x0000FFFF */
#define ETH_MACADDR2H_ADDR2H                                        ETH_MACADDR2H_ADDR2H_Msk                                       /* MAC address1 high */

