kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
/* Bit definition for Ethernet MAC Address2 Low Register */
#define ETH_MACADDR2L_ADDR2L_Pos                                    (0U)
#define ETH_MACADDR2L_ADDR2L_Msk                                    (0xFFFFFFFFUL << ETH_MACADDR2L_ADDR2L_Pos)                     /*!< 0xFFFFFFFF */
#define ETH_MACADDR2L_ADDR2L                                        ETH_MACADDR2L_ADDR2L_Msk                                       /* MAC address2 low */

/* Bit definition for Ethernet MAC Address3 High Register */
#define ETH_MACADDR3H_ADDREN_Pos                                    (31U)
#define ETH_MACADDR3H_ADDREN_Msk                                    (0x1UL << ETH_MACADDR3H_ADDREN_Pos)                            /*!< 0x80000000 */
#define ETH_MACADDR3H_ADDREN                                        ETH_MACADDR3H_ADDREN_Msk                                       /* Address enable */
#define ETH_MACADDR3H_ADDRSEL_Pos                                   (30U)
#define ETH_MACADDR3H_ADDRSEL_Msk                                   (0x1UL << ETH_MACADDR3H_ADDRSEL_Pos)                           /*!< 0x40000000 */
#define ETH_MACADDR3H_ADDRSEL                                       ETH_MACADDR3H_ADDRSEL_Msk                                      /* Source address */
#define ETH_MACADDR3H_MASKBCTRL_Pos                                 (24U)
#define ETH_MACADDR3H_MASKBCTRL_Msk                                 (0x3FUL << ETH_MACADDR3H_MASKBCTRL_Pos)                        /*!< 0x3F000000 */
#define ETH_MACADDR3H_MASKBCTRL                                     ETH_MACADDR3H_MASKBCTRL_Msk                                    /* Mask byte control */
#define ETH_MACADDR3H_MASKBCTRL_HBits15_8                           0x20000000U                                                    /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACADDR3H_MASKBCTRL_HBits7_0                            0x10000000U                                                    /* Mask MAC Address high reg bits [7:0]  */
#define ETH_MACADDR3H_MASKBCTRL_LBits31_24                          0x08000000U                                                    /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACADDR3H_MASKBCTRL_LBits23_16                          0x04000000U                                                    /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACADDR3H_MASKBCTRL_LBits15_8                           0x02000000U                                                    /* Mask MAC Address low reg bits [15:8]  */
#define ETH_MACADDR3H_MASKBCTRL_LBits7_0                            0x01000000U                                                    /* Mask MAC Address low reg bits [70]    */
#define ETH_MACADDR3H_ADDR3H_Pos                                    (0U)
#define ETH_MACADDR3H_ADDR3H_Msk                                    (0xFFFFUL << ETH_MACADDR3H_ADDR3H_Pos)                         /*!< 0x0000FFFF */
#define ETH_MACADDR3H_ADDR3H                                        ETH_MACADDR3H_ADDR3H_Msk                                       /* MAC address3 high */

/* Bit definition for Ethernet MAC Address3 Low Register */
#define ETH_MACADDR3L_ADDR3L_Pos                                    (0U)
#define ETH_MACADDR3L_ADDR3L_Msk                                    (0xFFFFFFFFUL << ETH_MACADDR3L_ADDR3L_Pos)                     /*!< 0xFFFFFFFF */
#define ETH_MACADDR3L_ADDR3L                                        ETH_MACADDR3L_ADDR3L_Msk                                       /* MAC address3 low */

/******************************************************************************/
/*                Ethernet MMC Registers bits definition                      */
/******************************************************************************/

/* Bit definition for Ethernet MMC Control Register */
#define ETH_MMCCTRL_MCNTVALP_Pos                                    (5U)
#define ETH_MMCCTRL_MCNTVALP_Msk                                    (0x1UL << ETH_MMCCTRL_MCNTVALP_Pos)                            /*!< 0x00000020 */
#define ETH_MMCCTRL_MCNTVALP                                        ETH_MMCCTRL_MCNTVALP_Msk                                       /* MMC counter Full-Half preset */
#define ETH_MMCCTRL_MCNTP_Pos                                       (4U)
#define ETH_MMCCTRL_MCNTP_Msk                                       (0x1UL << ETH_MMCCTRL_MCNTP_Pos)                               /*!< 0x00000010 */
#define ETH_MMCCTRL_MCNTP                                           ETH_MMCCTRL_MCNTP_Msk                                          /* MMC counter preset           */
#define ETH_MMCCTRL_MCNTF_Pos                                       (3U)
#define ETH_MMCCTRL_MCNTF_Msk                                       (0x1UL << ETH_MMCCTRL_MCNTF_Pos)                               /*!< 0x00000008 */
#define ETH_MMCCTRL_MCNTF                                           ETH_MMCCTRL_MCNTF_Msk                                          /* MMC Counter Freeze           */
#define ETH_MMCCTRL_RSTOR_Pos                                       (2U)
#define ETH_MMCCTRL_RSTOR_Msk                                       (0x1UL << ETH_MMCCTRL_RSTOR_Pos)                               /*!< 0x00000004 */
#define ETH_MMCCTRL_RSTOR                                           ETH_MMCCTRL_RSTOR_Msk                                          /* Reset on Read                */
#define ETH_MMCCTRL_CNTSTOPRO_Pos                                   (1U)
#define ETH_MMCCTRL_CNTSTOPRO_Msk                                   (0x1UL << ETH_MMCCTRL_CNTSTOPRO_Pos)                           /*!< 0x00000002 */
#define ETH_MMCCTRL_CNTSTOPRO                                       ETH_MMCCTRL_CNTSTOPRO_Msk                                      /* Counter Stop Rollover        */
#define ETH_MMCCTRL_CNTRST_Pos                                      (0U)
#define ETH_MMCCTRL_CNTRST_Msk                                      (0x1UL << ETH_MMCCTRL_CNTRST_Pos)                              /*!< 0x00000001 */
#define ETH_MMCCTRL_CNTRST                                          ETH_MMCCTRL_CNTRST_Msk                                         /* Counters Reset               */

/* Bit definition for Ethernet MMC Receive Interrupt Register */
#define ETH_MMCRXINT_RXGUNF_Pos                                     (17U)
#define ETH_MMCRXINT_RXGUNF_Msk                                     (0x1UL << ETH_MMCRXINT_RXGUNF_Pos)                             /*!< 0x00020000 */
#define ETH_MMCRXINT_RXGUNF                                         ETH_MMCRXINT_RXGUNF_Msk                                        /* Set when Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMCRXINT_RXFAE_Pos                                      (6U)
#define ETH_MMCRXINT_RXFAE_Msk                                      (0x1UL << ETH_MMCRXINT_RXFAE_Pos)                              /*!< 0x00000040 */
#define ETH_MMCRXINT_RXFAE                                          ETH_MMCRXINT_RXFAE_Msk                                         /* Set when Rx alignment error counter reaches half the maximum value */
#define ETH_MMCRXINT_RXFCE_Pos                                      (5U)
#define ETH_MMCRXINT_RXFCE_Msk                                      (0x1UL << ETH_MMCRXINT_RXFCE_Pos)                              /*!< 0x00000020 */
#define ETH_MMCRXINT_RXFCE                                          ETH_MMCRXINT_RXFCE_Msk                                         /* Set when Rx crc error counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmit Interrupt Register */
#define ETH_MMCTXINT_TXGF_Pos                                       (21U)
#define ETH_MMCTXINT_TXGF_Msk                                       (0x1UL << ETH_MMCTXINT_TXGF_Pos)                               /*!< 0x00200000 */
#define ETH_MMCTXINT_TXGF                                           ETH_MMCTXINT_TXGF_Msk                                          /* Set when Tx good frame count counter reaches half the maximum value */
#define ETH_MMCTXINT_TXGFMCOL_Pos                                   (15U)
#define ETH_MMCTXINT_TXGFMCOL_Msk                                   (0x1UL << ETH_MMCTXINT_TXGFMCOL_Pos)                           /*!< 0x00008000 */
#define ETH_MMCTXINT_TXGFMCOL                                       ETH_MMCTXINT_TXGFMCOL_Msk                                      /* Set when Tx good multi col counter reaches half the maximum value */
#define ETH_MMCTXINT_TXGFSCOL_Pos                                   (14U)
#define ETH_MMCTXINT_TXGFSCOL_Msk                                   (0x1UL << ETH_MMCTXINT_TXGFSCOL_Pos)                           /*!< 0x00004000 */
#define ETH_MMCTXINT_TXGFSCOL                                       ETH_MMCTXINT_TXGFSCOL_Msk                                      /* Set when Tx good single col counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Receive Interrupt Mask Register */
#define ETH_MMCRXINTMASK_RXGUNFM_Pos                                (17U)
#define ETH_MMCRXINTMASK_RXGUNFM_Msk                                (0x1UL << ETH_MMCRXINTMASK_RXGUNFM_Pos)                        /*!< 0x00020000 */
#define ETH_MMCRXINTMASK_RXGUNFM                                    ETH_MMCRXINTMASK_RXGUNFM_Msk                                   /* Mask the interrupt when Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMCRXINTMASK_RXFAEM_Pos                                 (6U)
#define ETH_MMCRXINTMASK_RXFAEM_Msk                                 (0x1UL << ETH_MMCRXINTMASK_RXFAEM_Pos)                         /*!< 0x00000040 */
#define ETH_MMCRXINTMASK_RXFAEM                                     ETH_MMCRXINTMASK_RXFAEM_Msk                                    /* Mask the interrupt when when Rx alignment error counter reaches half the maximum value */
#define ETH_MMCRXINTMASK_RXFCEM_Pos                                 (5U)
#define ETH_MMCRXINTMASK_RXFCEM_Msk                                 (0x1UL << ETH_MMCRXINTMASK_RXFCEM_Pos)                         /*!< 0x00000020 */
#define ETH_MMCRXINTMASK_RXFCEM                                     ETH_MMCRXINTMASK_RXFCEM_Msk                                    /* Mask the interrupt when Rx crc error counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmit Interrupt Mask Register */
#define ETH_MMCTXINTMASK_TXGFM_Pos                                  (21U)
#define ETH_MMCTXINTMASK_TXGFM_Msk                                  (0x1UL << ETH_MMCTXINTMASK_TXGFM_Pos)                          /*!< 0x00200000 */
#define ETH_MMCTXINTMASK_TXGFM                                      ETH_MMCTXINTMASK_TXGFM_Msk                                     /* Mask the interrupt when Tx good frame count counter reaches half the maximum value */
#define ETH_MMCTXINTMASK_TXGFMCOLM_Pos                              (15U)
#define ETH_MMCTXINTMASK_TXGFMCOLM_Msk                              (0x1UL << ETH_MMCTXINTMASK_TXGFMCOLM_Pos)                      /*!< 0x00008000 */
#define ETH_MMCTXINTMASK_TXGFMCOLM                                  ETH_MMCTXINTMASK_TXGFMCOLM_Msk                                 /* Mask the interrupt when Tx good multi col counter reaches half the maximum value */
#define ETH_MMCTXINTMASK_TXGFSCOLM_Pos                              (14U)
#define ETH_MMCTXINTMASK_TXGFSCOLM_Msk                              (0x1UL << ETH_MMCTXINTMASK_TXGFSCOLM_Pos)                      /*!< 0x00004000 */
#define ETH_MMCTXINTMASK_TXGFSCOLM                                  ETH_MMCTXINTMASK_TXGFSCOLM_Msk                                 /* Mask the interrupt when Tx good single col counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmitted Good Frames after Single Collision Counter Register */
#define ETH_MMCTXGFSCCNT_TXGFSCCNT_Pos                              (0U)
#define ETH_MMCTXGFSCCNT_TXGFSCCNT_Msk                              (0xFFFFFFFFUL << ETH_MMCTXGFSCCNT_TXGFSCCNT_Pos)               /*!< 0xFFFFFFFF */
#define ETH_MMCTXGFSCCNT_TXGFSCCNT                                  ETH_MMCTXGFSCCNT_TXGFSCCNT_Msk                                 /* Number of successfully transmitted frames after a single collision in Half-duplex mode. */

/* Bit definition for Ethernet MMC Transmitted Good Frames after More than a Single Collision Counter Register */
#define ETH_MMCTXGFMCCNT_TXGFMCCNT_Pos                              (0U)
#define ETH_MMCTXGFMCCNT_TXGFMCCNT_Msk                              (0xFFFFFFFFUL << ETH_MMCTXGFMCCNT_TXGFMCCNT_Pos)               /*!< 0xFFFFFFFF */
#define ETH_MMCTXGFMCCNT_TXGFMCCNT                                  ETH_MMCTXGFMCCNT_TXGFMCCNT_Msk                                 /* Number of successfully transmitted frames after more than a single collision in Half-duplex mode. */

/* Bit definition for Ethernet MMC Transmitted Good Frames Counter Register */
#define ETH_MMCTXGFCNT_TXGFCNT_Pos                                  (0U)
#define ETH_MMCTXGFCNT_TXGFCNT_Msk                                  (0xFFFFFFFFUL << ETH_MMCTXGFCNT_TXGFCNT_Pos)                   /*!< 0xFFFFFFFF */
#define ETH_MMCTXGFCNT_TXGFCNT                                      ETH_MMCTXGFCNT_TXGFCNT_Msk                                     /* Number of good frames transmitted. */

