kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f425xx.h
/* Bit definition for Ethernet DMA Transmit Poll Demand Register */
#define ETH_DMATXPD_TXPD_Pos                                        (0U)
#define ETH_DMATXPD_TXPD_Msk                                        (0xFFFFFFFFUL << ETH_DMATXPD_TXPD_Pos)                         /*!< 0xFFFFFFFF */
#define ETH_DMATXPD_TXPD                                            ETH_DMATXPD_TXPD_Msk                                           /* Transmit poll demand */

/* Bit definition for Ethernet DMA Receive Poll Demand Register */
#define ETH_DMARXPD_RXPD_Pos                                        (0U)
#define ETH_DMARXPD_RXPD_Msk                                        (0xFFFFFFFFUL << ETH_DMARXPD_RXPD_Pos)                         /*!< 0xFFFFFFFF */
#define ETH_DMARXPD_RXPD                                            ETH_DMARXPD_RXPD_Msk                                           /* Receive poll demand  */

/* Bit definition for Ethernet DMA Receive Descriptor List Address Register */
#define ETH_DMARXDLADDR_RXSTA_Pos                                   (0U)
#define ETH_DMARXDLADDR_RXSTA_Msk                                   (0xFFFFFFFFUL << ETH_DMARXDLADDR_RXSTA_Pos)                    /*!< 0xFFFFFFFF */
#define ETH_DMARXDLADDR_RXSTA                                       ETH_DMARXDLADDR_RXSTA_Msk                                      /* Start of receive list */

/* Bit definition for Ethernet DMA Transmit Descriptor List Address Register */
#define ETH_DMATXDLADDR_TXSTA_Pos                                   (0U)
#define ETH_DMATXDLADDR_TXSTA_Msk                                   (0xFFFFFFFFUL << ETH_DMATXDLADDR_TXSTA_Pos)                    /*!< 0xFFFFFFFF */
#define ETH_DMATXDLADDR_TXSTA                                       ETH_DMATXDLADDR_TXSTA_Msk                                      /* Start of transmit list */

/* Bit definition for Ethernet DMA Status Register */
#define ETH_DMASTS_TSTFLG_Pos                                       (29U)
#define ETH_DMASTS_TSTFLG_Msk                                       (0x1UL << ETH_DMASTS_TSTFLG_Pos)                               /*!< 0x20000000 */
#define ETH_DMASTS_TSTFLG                                           ETH_DMASTS_TSTFLG_Msk                                          /* Time-stamp trigger status */
#define ETH_DMASTS_PMTFLG_Pos                                       (28U)
#define ETH_DMASTS_PMTFLG_Msk                                       (0x1UL << ETH_DMASTS_PMTFLG_Pos)                               /*!< 0x10000000 */
#define ETH_DMASTS_PMTFLG                                           ETH_DMASTS_PMTFLG_Msk                                          /* PMT status */
#define ETH_DMASTS_MMCFLG_Pos                                       (27U)
#define ETH_DMASTS_MMCFLG_Msk                                       (0x1UL << ETH_DMASTS_MMCFLG_Pos)                               /*!< 0x08000000 */
#define ETH_DMASTS_MMCFLG                                           ETH_DMASTS_MMCFLG_Msk                                          /* MMC status */
#define ETH_DMASTS_ERRB_Pos                                         (23U)
#define ETH_DMASTS_ERRB_Msk                                         (0x7UL << ETH_DMASTS_ERRB_Pos)                                 /*!< 0x03800000 */
#define ETH_DMASTS_ERRB                                             ETH_DMASTS_ERRB_Msk                                            /* Error bits status */
  /* combination with EBS[2:0] for GetFlagStatus function */
#define ETH_DMASTS_ERRB_DescAccess_Pos                              (25U)
#define ETH_DMASTS_ERRB_DescAccess_Msk                              (0x1UL << ETH_DMASTS_ERRB_DescAccess_Pos)                      /*!< 0x02000000 */
#define ETH_DMASTS_ERRB_DescAccess                                  ETH_DMASTS_ERRB_DescAccess_Msk                                 /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMASTS_ERRB_ReadTransf_Pos                              (24U)
#define ETH_DMASTS_ERRB_ReadTransf_Msk                              (0x1UL << ETH_DMASTS_ERRB_ReadTransf_Pos)                      /*!< 0x01000000 */
#define ETH_DMASTS_ERRB_ReadTransf                                  ETH_DMASTS_ERRB_ReadTransf_Msk                                 /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMASTS_ERRB_DataTransfTx_Pos                            (23U)
#define ETH_DMASTS_ERRB_DataTransfTx_Msk                            (0x1UL << ETH_DMASTS_ERRB_DataTransfTx_Pos)                    /*!< 0x00800000 */
#define ETH_DMASTS_ERRB_DataTransfTx                                ETH_DMASTS_ERRB_DataTransfTx_Msk                               /* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMASTS_TXSTS_Pos                                        (20U)
#define ETH_DMASTS_TXSTS_Msk                                        (0x7UL << ETH_DMASTS_TXSTS_Pos)                                /*!< 0x00700000 */
#define ETH_DMASTS_TXSTS                                            ETH_DMASTS_TXSTS_Msk                                           /* Transmit process state */
#define ETH_DMASTS_TXSTS_Stopped                                    0x00000000U                                                    /* Stopped - Reset or Stop Tx Command issued  */
#define ETH_DMASTS_TXSTS_Fetching_Pos                               (20U)
#define ETH_DMASTS_TXSTS_Fetching_Msk                               (0x1UL << ETH_DMASTS_TXSTS_Fetching_Pos)                       /*!< 0x00100000 */
#define ETH_DMASTS_TXSTS_Fetching                                   ETH_DMASTS_TXSTS_Fetching_Msk                                  /* Running - fetching the Tx descriptor */
#define ETH_DMASTS_TXSTS_Waiting_Pos                                (21U)
#define ETH_DMASTS_TXSTS_Waiting_Msk                                (0x1UL << ETH_DMASTS_TXSTS_Waiting_Pos)                        /*!< 0x00200000 */
#define ETH_DMASTS_TXSTS_Waiting                                    ETH_DMASTS_TXSTS_Waiting_Msk                                   /* Running - waiting for status */
#define ETH_DMASTS_TXSTS_Reading_Pos                                (20U)
#define ETH_DMASTS_TXSTS_Reading_Msk                                (0x3UL << ETH_DMASTS_TXSTS_Reading_Pos)                        /*!< 0x00300000 */
#define ETH_DMASTS_TXSTS_Reading                                    ETH_DMASTS_TXSTS_Reading_Msk                                   /* Running - reading the data from host memory */
#define ETH_DMASTS_TXSTS_Suspended_Pos                              (21U)
#define ETH_DMASTS_TXSTS_Suspended_Msk                              (0x3UL << ETH_DMASTS_TXSTS_Suspended_Pos)                      /*!< 0x00600000 */
#define ETH_DMASTS_TXSTS_Suspended                                  ETH_DMASTS_TXSTS_Suspended_Msk                                 /* Suspended - Tx Descriptor unavailable */
#define ETH_DMASTS_TXSTS_Closing_Pos                                (20U)
#define ETH_DMASTS_TXSTS_Closing_Msk                                (0x7UL << ETH_DMASTS_TXSTS_Closing_Pos)                        /*!< 0x00700000 */
#define ETH_DMASTS_TXSTS_Closing                                    ETH_DMASTS_TXSTS_Closing_Msk                                   /* Running - closing Rx descriptor */
#define ETH_DMASTS_RXSTS_Pos                                        (17U)
#define ETH_DMASTS_RXSTS_Msk                                        (0x7UL << ETH_DMASTS_RXSTS_Pos)                                /*!< 0x000E0000 */
#define ETH_DMASTS_RXSTS                                            ETH_DMASTS_RXSTS_Msk                                           /* Receive process state */
#define ETH_DMASTS_RXSTS_Stopped                                    0x00000000U                                                    /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMASTS_RXSTS_Fetching_Pos                               (17U)
#define ETH_DMASTS_RXSTS_Fetching_Msk                               (0x1UL << ETH_DMASTS_RXSTS_Fetching_Pos)                       /*!< 0x00020000 */
#define ETH_DMASTS_RXSTS_Fetching                                   ETH_DMASTS_RXSTS_Fetching_Msk                                  /* Running - fetching the Rx descriptor */
#define ETH_DMASTS_RXSTS_Waiting_Pos                                (17U)
#define ETH_DMASTS_RXSTS_Waiting_Msk                                (0x3UL << ETH_DMASTS_RXSTS_Waiting_Pos)                        /*!< 0x00060000 */
#define ETH_DMASTS_RXSTS_Waiting                                    ETH_DMASTS_RXSTS_Waiting_Msk                                   /* Running - waiting for packet */
#define ETH_DMASTS_RXSTS_Suspended_Pos                              (19U)
#define ETH_DMASTS_RXSTS_Suspended_Msk                              (0x1UL << ETH_DMASTS_RXSTS_Suspended_Pos)                      /*!< 0x00080000 */
#define ETH_DMASTS_RXSTS_Suspended                                  ETH_DMASTS_RXSTS_Suspended_Msk                                 /* Suspended - Rx Descriptor unavailable */
#define ETH_DMASTS_RXSTS_Closing_Pos                                (17U)
#define ETH_DMASTS_RXSTS_Closing_Msk                                (0x5UL << ETH_DMASTS_RXSTS_Closing_Pos)                        /*!< 0x000A0000 */
#define ETH_DMASTS_RXSTS_Closing                                    ETH_DMASTS_RXSTS_Closing_Msk                                   /* Running - closing descriptor */
#define ETH_DMASTS_RXSTS_Queuing_Pos                                (17U)
#define ETH_DMASTS_RXSTS_Queuing_Msk                                (0x7UL << ETH_DMASTS_RXSTS_Queuing_Pos)                        /*!< 0x000E0000 */
#define ETH_DMASTS_RXSTS_Queuing                                    ETH_DMASTS_RXSTS_Queuing_Msk                                   /* Running - queuing the receive frame into host memory */
#define ETH_DMASTS_NINTS_Pos                                        (16U)
#define ETH_DMASTS_NINTS_Msk                                        (0x1UL << ETH_DMASTS_NINTS_Pos)                                /*!< 0x00010000 */
#define ETH_DMASTS_NINTS                                            ETH_DMASTS_NINTS_Msk                                           /* Normal interrupt summary */
#define ETH_DMASTS_AINTS_Pos                                        (15U)
#define ETH_DMASTS_AINTS_Msk                                        (0x1UL << ETH_DMASTS_AINTS_Pos)                                /*!< 0x00008000 */
#define ETH_DMASTS_AINTS                                            ETH_DMASTS_AINTS_Msk                                           /* Abnormal interrupt summary */
#define ETH_DMASTS_ERXFLG_Pos                                       (14U)
#define ETH_DMASTS_ERXFLG_Msk                                       (0x1UL << ETH_DMASTS_ERXFLG_Pos)                               /*!< 0x00004000 */
#define ETH_DMASTS_ERXFLG                                           ETH_DMASTS_ERXFLG_Msk                                          /* Early receive status */
#define ETH_DMASTS_FBERRFLG_Pos                                     (13U)
#define ETH_DMASTS_FBERRFLG_Msk                                     (0x1UL << ETH_DMASTS_FBERRFLG_Pos)                             /*!< 0x00002000 */
#define ETH_DMASTS_FBERRFLG                                         ETH_DMASTS_FBERRFLG_Msk                                        /* Fatal bus error status */
#define ETH_DMASTS_ETXFLG_Pos                                       (10U)
#define ETH_DMASTS_ETXFLG_Msk                                       (0x1UL << ETH_DMASTS_ETXFLG_Pos)                               /*!< 0x00000400 */
#define ETH_DMASTS_ETXFLG                                           ETH_DMASTS_ETXFLG_Msk                                          /* Early transmit status */
#define ETH_DMASTS_RXWTOFLG_Pos                                     (9U)
#define ETH_DMASTS_RXWTOFLG_Msk                                     (0x1UL << ETH_DMASTS_RXWTOFLG_Pos)                             /*!< 0x00000200 */
#define ETH_DMASTS_RXWTOFLG                                         ETH_DMASTS_RXWTOFLG_Msk                                        /* Receive watchdog timeout status */
#define ETH_DMASTS_RXSFLG_Pos                                       (8U)
#define ETH_DMASTS_RXSFLG_Msk                                       (0x1UL << ETH_DMASTS_RXSFLG_Pos)                               /*!< 0x00000100 */
#define ETH_DMASTS_RXSFLG                                           ETH_DMASTS_RXSFLG_Msk                                          /* Receive process stopped status */
#define ETH_DMASTS_RXBU_Pos                                         (7U)
#define ETH_DMASTS_RXBU_Msk                                         (0x1UL << ETH_DMASTS_RXBU_Pos)                                 /*!< 0x00000080 */
#define ETH_DMASTS_RXBU                                             ETH_DMASTS_RXBU_Msk                                            /* Receive buffer unavailable status */
#define ETH_DMASTS_RXFLG_Pos                                        (6U)
#define ETH_DMASTS_RXFLG_Msk                                        (0x1UL << ETH_DMASTS_RXFLG_Pos)                                /*!< 0x00000040 */
#define ETH_DMASTS_RXFLG                                            ETH_DMASTS_RXFLG_Msk                                           /* Receive status */
#define ETH_DMASTS_TXUNF_Pos                                        (5U)
#define ETH_DMASTS_TXUNF_Msk                                        (0x1UL << ETH_DMASTS_TXUNF_Pos)                                /*!< 0x00000020 */
#define ETH_DMASTS_TXUNF                                            ETH_DMASTS_TXUNF_Msk                                           /* Transmit underflow status */
#define ETH_DMASTS_RXOVF_Pos                                        (4U)
#define ETH_DMASTS_RXOVF_Msk                                        (0x1UL << ETH_DMASTS_RXOVF_Pos)                                /*!< 0x00000010 */
#define ETH_DMASTS_RXOVF                                            ETH_DMASTS_RXOVF_Msk                                           /* Receive overflow status */
#define ETH_DMASTS_TXJTO_Pos                                        (3U)
#define ETH_DMASTS_TXJTO_Msk                                        (0x1UL << ETH_DMASTS_TXJTO_Pos)                                /*!< 0x00000008 */
#define ETH_DMASTS_TXJTO                                            ETH_DMASTS_TXJTO_Msk                                           /* Transmit jabber timeout status */
#define ETH_DMASTS_TXBU_Pos                                         (2U)
#define ETH_DMASTS_TXBU_Msk                                         (0x1UL << ETH_DMASTS_TXBU_Pos)                                 /*!< 0x00000004 */
#define ETH_DMASTS_TXBU                                             ETH_DMASTS_TXBU_Msk                                            /* Transmit buffer unavailable status */
#define ETH_DMASTS_TXSFLG_Pos                                       (1U)
#define ETH_DMASTS_TXSFLG_Msk                                       (0x1UL << ETH_DMASTS_TXSFLG_Pos)                               /*!< 0x00000002 */
#define ETH_DMASTS_TXSFLG                                           ETH_DMASTS_TXSFLG_Msk                                          /* Transmit process stopped status */
#define ETH_DMASTS_TXFLG_Pos                                        (0U)
#define ETH_DMASTS_TXFLG_Msk                                        (0x1UL << ETH_DMASTS_TXFLG_Pos)                                /*!< 0x00000001 */
#define ETH_DMASTS_TXFLG                                            ETH_DMASTS_TXFLG_Msk                                           /* Transmit status */

/* Bit definition for Ethernet DMA Operation Mode Register */
#define ETH_DMAOPMOD_DISDT_Pos                                      (26U)
#define ETH_DMAOPMOD_DISDT_Msk                                      (0x1UL << ETH_DMAOPMOD_DISDT_Pos)                              /*!< 0x04000000 */
#define ETH_DMAOPMOD_DISDT                                          ETH_DMAOPMOD_DISDT_Msk                                         /* Disable Dropping of TCP/IP checksum error frames */
#define ETH_DMAOPMOD_RXSF_Pos                                       (25U)
#define ETH_DMAOPMOD_RXSF_Msk                                       (0x1UL << ETH_DMAOPMOD_RXSF_Pos)                               /*!< 0x02000000 */
#define ETH_DMAOPMOD_RXSF                                           ETH_DMAOPMOD_RXSF_Msk                                          /* Receive store and forward */
#define ETH_DMAOPMOD_DISFRXF_Pos                                    (24U)
#define ETH_DMAOPMOD_DISFRXF_Msk                                    (0x1UL << ETH_DMAOPMOD_DISFRXF_Pos)                            /*!< 0x01000000 */
#define ETH_DMAOPMOD_DISFRXF                                        ETH_DMAOPMOD_DISFRXF_Msk                                       /* Disable flushing of received frames */
#define ETH_DMAOPMOD_TXSF_Pos                                       (21U)
#define ETH_DMAOPMOD_TXSF_Msk                                       (0x1UL << ETH_DMAOPMOD_TXSF_Pos)                               /*!< 0x00200000 */
#define ETH_DMAOPMOD_TXSF                                           ETH_DMAOPMOD_TXSF_Msk                                          /* Transmit store and forward */
#define ETH_DMAOPMOD_FTXF_Pos                                       (20U)
#define ETH_DMAOPMOD_FTXF_Msk                                       (0x1UL << ETH_DMAOPMOD_FTXF_Pos)                               /*!< 0x00100000 */
#define ETH_DMAOPMOD_FTXF                                           ETH_DMAOPMOD_FTXF_Msk                                          /* Flush transmit FIFO */
#define ETH_DMAOPMOD_TXTHCTRL_Pos                                   (14U)
#define ETH_DMAOPMOD_TXTHCTRL_Msk                                   (0x7UL << ETH_DMAOPMOD_TXTHCTRL_Pos)                           /*!< 0x0001C000 */
#define ETH_DMAOPMOD_TXTHCTRL                                       ETH_DMAOPMOD_TXTHCTRL_Msk                                      /* Transmit threshold control */
#define ETH_DMAOPMOD_TXTHCTRL_64Bytes                               0x00000000U                                                    /* threshold level of the MTL Transmit FIFO is 64 Bytes */
#define ETH_DMAOPMOD_TXTHCTRL_128Bytes                              0x00004000U                                                    /* threshold level of the MTL Transmit FIFO is 128 Bytes */
#define ETH_DMAOPMOD_TXTHCTRL_192Bytes                              0x00008000U                                                    /* threshold level of the MTL Transmit FIFO is 192 Bytes */
#define ETH_DMAOPMOD_TXTHCTRL_256Bytes                              0x0000C000U                                                    /* threshold level of the MTL Transmit FIFO is 256 Bytes */
#define ETH_DMAOPMOD_TXTHCTRL_40Bytes                               0x00010000U                                                    /* threshold level of the MTL Transmit FIFO is 40 Bytes */
#define ETH_DMAOPMOD_TXTHCTRL_32Bytes                               0x00014000U                                                    /* threshold level of the MTL Transmit FIFO is 32 Bytes */
#define ETH_DMAOPMOD_TXTHCTRL_24Bytes                               0x00018000U                                                    /* threshold level of the MTL Transmit FIFO is 24 Bytes */
#define ETH_DMAOPMOD_TXTHCTRL_16Bytes                               0x0001C000U                                                    /* threshold level of the MTL Transmit FIFO is 16 Bytes */
#define ETH_DMAOPMOD_STTX_Pos                                       (13U)
#define ETH_DMAOPMOD_STTX_Msk                                       (0x1UL << ETH_DMAOPMOD_STTX_Pos)                               /*!< 0x00002000 */
#define ETH_DMAOPMOD_STTX                                           ETH_DMAOPMOD_STTX_Msk                                          /* Start/stop transmission command */
#define ETH_DMAOPMOD_FERRF_Pos                                      (7U)
#define ETH_DMAOPMOD_FERRF_Msk                                      (0x1UL << ETH_DMAOPMOD_FERRF_Pos)                              /*!< 0x00000080 */
#define ETH_DMAOPMOD_FERRF                                          ETH_DMAOPMOD_FERRF_Msk                                         /* Forward error frames */
#define ETH_DMAOPMOD_FUF_Pos                                        (6U)
#define ETH_DMAOPMOD_FUF_Msk                                        (0x1UL << ETH_DMAOPMOD_FUF_Pos)                                /*!< 0x00000040 */
#define ETH_DMAOPMOD_FUF                                            ETH_DMAOPMOD_FUF_Msk                                           /* Forward undersized good frames */
#define ETH_DMAOPMOD_RXTHCTRL_Pos                                   (3U)
#define ETH_DMAOPMOD_RXTHCTRL_Msk                                   (0x3UL << ETH_DMAOPMOD_RXTHCTRL_Pos)                           /*!< 0x00000018 */
#define ETH_DMAOPMOD_RXTHCTRL                                       ETH_DMAOPMOD_RXTHCTRL_Msk                                      /* receive threshold control */
#define ETH_DMAOPMOD_RXTHCTRL_64Bytes                               0x00000000U                                                    /* threshold level of the MTL Receive FIFO is 64 Bytes */
#define ETH_DMAOPMOD_RXTHCTRL_32Bytes                               0x00000008U                                                    /* threshold level of the MTL Receive FIFO is 32 Bytes */
#define ETH_DMAOPMOD_RXTHCTRL_96Bytes                               0x00000010U                                                    /* threshold level of the MTL Receive FIFO is 96 Bytes */
#define ETH_DMAOPMOD_RXTHCTRL_128Bytes                              0x00000018U                                                    /* threshold level of the MTL Receive FIFO is 128 Bytes */
#define ETH_DMAOPMOD_OSECF_Pos                                      (2U)
#define ETH_DMAOPMOD_OSECF_Msk                                      (0x1UL << ETH_DMAOPMOD_OSECF_Pos)                              /*!< 0x00000004 */
#define ETH_DMAOPMOD_OSECF                                          ETH_DMAOPMOD_OSECF_Msk                                         /* operate on second frame */
#define ETH_DMAOPMOD_STRX_Pos                                       (1U)
#define ETH_DMAOPMOD_STRX_Msk                                       (0x1UL << ETH_DMAOPMOD_STRX_Pos)                               /*!< 0x00000002 */
#define ETH_DMAOPMOD_STRX                                           ETH_DMAOPMOD_STRX_Msk                                          /* Start/stop receive */

